GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
/*
 * Copyright (c) 2020-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "Arduino.h"
#include "BLE.h"
#include "wiring_private.h"

#include "stm32wb_ipcc.h"
#include "stm32wb_boot.h"
#include "stm32wb_fwu.h"

extern "C" {
#include "BLE/ble_core.h"
}

#define BLE_TRACE_SUPPORTED                              0
#define BLE_STATUS_REQUEST_BUSY                          0xff

#define BLE_ADDRESS_LENGTH                               6
#define BLE_UUID16_LENGTH                                2
#define BLE_UUID128_LENGTH                               16
#define BLE_MAX_UUID_LENGTH                              16
#define BLE_MIN_DEVICE_NAME_LENGTH                       32
#define BLE_MAX_DEVICE_NAME_LENGTH                       248

#define BLE_SLAVE_SCA                                    500
#define BLE_MASTER_SCA                                   0     /* 251 ppm to 500 ppm */

#if defined(STM32WB_CONFIG_BLE_LSE_SOURCE)
#define BLE_LSE_SOURCE                                   STM32WB_CONFIG_BLE_LSE_SOURCE
#else /* STM32WB_CONFIG_BLE_LSE_SOURCE */
#define BLE_LSE_SOURCE                                   BLE_LSE_SOURCE_NOCALIB
#endif /* STM32WB_CONFIG_BLE_LSE_SOURCE */

#if defined(STM32WB_CONFIG_BLE_HSE_STARTUP_TIME)
#define BLE_HSE_STARTUP_TIME                             STM32WB_CONFIG_BLE_HSE_STARTUP_TIME
#else /* STM32WB_CONFIG_BLE_HSE_STARTUP_TIME */
#define BLE_HSE_STARTUP_TIME                             0x148 /* units of 625/256 us (~2.44 us), 800us */
#endif /* STM32WB_CONFIG_BLE_HSE_STARTUP_TIME */

#if defined(STM32WB_CONFIG_BLE_MIN_TX_POWER)
#define BLE_MIN_TX_POWER                                 STM32WB_CONFIG_BLE_MIN_TX_POWER
#else /* STM32WB_CONFIG_BLE_MIN_TX_POWER */
#define BLE_MIN_TX_POWER                                 -40
#endif /* STM32WB_CONFIG_BLE_MIN_TX_POWER */

#if defined(STM32WB_CONFIG_BLE_MAX_TX_POWER)
#define BLE_MAX_TX_POWER                                 STM32WB_CONFIG_BLE_MAX_TX_POWER
#else /* STM32WB_CONFIG_BLE_MAX_TX_POWER */
#define BLE_MAX_TX_POWER                                 6
#endif /* STM32WB_CONFIG_BLE_MAX_TX_POWER */

#if defined(STM32WB_CONFIG_BLE_RX_MODEL)
#define BLE_RX_MODEL                                     STM32WB_CONFIG_BLE_RX_MODEL
#else /* STM32WB_CONFIG_BLE_RX_MODEL */
#define BLE_RX_MODEL                                     BLE_RX_MODEL_AGC_RSSI_LEGACY
#endif /* STM32WB_CONFIG_BLE_RX_MODEL */

#if defined(STM32WB_CONFIG_BLE_TX_PATH_COMPENSATION)
#define BLE_TX_PATH_COMPENSATION                         STM32WB_CONFIG_BLE_TX_PATH_COMPENSATION
#else /* STM32WB_CONFIG_BLE_TX_PATH_COMPENSATION */
#define BLE_TX_PATH_COMPENSATION                         0
#endif /* STM32WB_CONFIG_BLE_TX_PATH_COMPENSATION */

#if defined(STM32WB_CONFIG_BLE_RX_PATH_COMPENSATION)
#define BLE_RX_PATH_COMPENSATION                         STM32WB_CONFIG_BLE_RX_PATH_COMPENSATION
#else /* STM32WB_CONFIG_BLE_RX_PATH_COMPENSATION */
#define BLE_RX_PATH_COMPENSATION                         0
#endif /* STM32WB_CONFIG_BLE_RX_PATH_COMPENSATION */

#define BLE_NUM_LINK                                     1
#define BLE_DATA_LENGTH_EXTENSION                        1
//#define BLE_MAX_ATT_MTU                                  156
#define BLE_MAX_ATT_MTU                                  251
#define BLE_VITERBI_MODE                                 1
#define BLE_MAX_CONN_EVENT_LENGTH                        0xffffffff

#define BLE_NUM_GATT_ATTRIBUTES                          68
#define BLE_NUM_GATT_SERVICES                            8
#define BLE_ATT_VALUE_ARRAY_SIZE                         1344

#define BLE_PREPARE_WRITE_LIST_SIZE                      (BLE_PREP_WRITE_X_ATT(BLE_MAX_ATT_MTU))
#define BLE_MBLOCK_COUNT                                 (BLE_MBLOCKS_CALC(BLE_PREPARE_WRITE_LIST_SIZE, BLE_MAX_ATT_MTU, BLE_NUM_LINK))

#define BLE_LSE_SOURCE_NOCALIB                           0x00
#define BLE_LSE_SOURCE_CALIB                             0x01
#define BLE_LSE_SOURCE_MOD5MM                            0x02
#define BLE_LSE_SOURCE_HSE                               0x04 /* HSE/1024 vs LSE */

#define BLE_OPTION_LL_ONLY                               0x01
#define BLE_OPTION_NO_SERVICE_CHANGED                    0x02
#define BLE_OPTION_READ_ONLY_DEVICE_NAME                 0x04
#define BLE_OPTION_EXT_ADV                               0x10
#define BLE_OPTION_CS_ALGO2                              0x20
#define BLE_OPTION_POWER_CLASS_2_3                       0x00
#define BLE_OPTION_POWER_CLASS_1                         0x80

#define BLE_RX_MODEL_AGC_RSSI_LEGACY                     0x00
#define BLE_RX_MODEL_AGC_RSSI_BLOCKER                    0x01

#define BLE_CORE_VERSION_5_2                             11 
#define BLE_CORE_VERSION_5_3                             12

#define BLE_VALUE_ATTRIB_HANDLE_OFFSET                   1
#define BLE_CCCD_ATTRIB_HANDLE_OFFSET                    2

