GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
#define BLE_ATT_SERVICE_HANDLE                           0x0001
#define BLE_SERVICE_CHANGED_HANDLE                       0x0002

#define BLE_BUSY_MASK                                    0x0000ffff
#define BLE_BUSY_HCI_LE_SET_PHY                          0x00000001
#define BLE_BUSY_L2CAP_CONNECTION_PARAMETER_UPDATE       0x00000002
#define BLE_BUSY_GAP_SLAVE_SECURITY                      0x00000004
#define BLE_BUSY_GAP_ALLOW_REBOND                        0x00000008
#define BLE_BUSY_GAP_TERMINATE                           0x00000010
#define BLE_BUSY_GATT_UPDATE_CHAR_VALUE_EXT              0x00000020
#define BLE_BUSY_GATT_READ_HANDLE_VALUE                  0x00000040
#define BLE_BUSY_GATT_CONFIRM_INDICATION                 0x00000080
#define BLE_BUSY_GATT_ALLOW_READ                         0x00000100

#define BLE_REQUEST_MASK                                 0x0fff0000
#define BLE_REQUEST_HCI_LE_SET_PHY                       0x00010000
#define BLE_REQUEST_L2CAP_CONNECTION_PARAMETER_UPDATE    0x00020000
#define BLE_REQUEST_GAP_SLAVE_SECURITY                   0x00040000
#define BLE_REQUEST_GAP_ALLOW_REBOND                     0x00080000
#define BLE_REQUEST_GAP_TERMINATE                        0x00100000
#define BLE_REQUEST_GATT_CONFIRM_INDICATION              0x00200000
#define BLE_REQUEST_GATT_ALLOW_READ                      0x00400000

#define BLE_EVENT_MASK                                   0xf0000000
#define BLE_EVENT_GAP_PAIRING_COMPLETE                   0x10000000
#define BLE_EVENT_GATT_TX_POOL_AVAILABLE                 0x20000000
#define BLE_EVENT_GATT_SERVER_CONFIRMATION               0x40000000

#define BLE_PEER_DEVICE_NOT_CONNECTED                    0xffff

#define BLE_FIXED_PIN_UNDEFINED                          0xffffffff

#define BLE_TEST_MODE_NONE                               0
#define BLE_TEST_MODE_TRANSMIT                           1
#define BLE_TEST_MODE_RECEIVE                            2

static const void *allocate_noconst(const void *data, uint32_t size) {
    void *_data;
    
    if (((uint32_t)data >= FLASH_BASE) && ((uint32_t)data <= (FLASH_BASE + FLASH_SIZE))) {
        return data;
    }

    _data = malloc(size);

    if (_data) {
        memcpy(_data, data, size);
    }

    return (const void*)_data;
}

static void deallocate_noconst(const void *data) {
    if (!(((uint32_t)data >= FLASH_BASE) && ((uint32_t)data <= (FLASH_BASE + FLASH_SIZE)))) {
        free((void*)data);
    }
}
        
static int ascii2hex(char c) {
    if ((c >= '0') && (c <= '9')) { return ((c - '0') + 0x00); }
    if ((c >= 'a') && (c <= 'f')) { return ((c - 'a') + 0x0a); }
    if ((c >= 'A') && (c <= 'F')) { return ((c - 'A') + 0x0a); }

    return -1;
}

static const char hex2ascii[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'a', 'b', 'c', 'd', 'e', 'f' };

/**********************************************************************************
 * Address
 */

enum class BLEAddressType : uint8_t {
    PUBLIC                        = 0,
    RANDOM_STATIC                 = 1,
    RANDOM_PRIVATE_RESOLVABLE     = 2,
    RANDOM_PRIVATE_NON_RESOLVABLE = 3,
    UNDEFINED                     = 255,
};
  
class BLEAddress {
public:
    BLEAddress();
    BLEAddress(const char *cstring, BLEAddressType type);
    BLEAddress(const uint8_t data[BLE_ADDRESS_LENGTH], BLEAddressType type);

    operator bool() const;
    
    BLEAddressType type() const;
    const uint8_t *data() const;
    uint32_t toString(char* cstring, uint32_t size, bool stripped = false) const;
    String toString(bool stripped = false) const;
    
private:
    BLEAddressType m_type;
    uint8_t m_data[BLE_ADDRESS_LENGTH];
};

BLEAddress::BLEAddress() {
    m_type = BLEAddressType::UNDEFINED;
}

BLEAddress::BLEAddress(const char *cstring, BLEAddressType type) {
    int index, length, data_l, data_h;

    memset(&m_data[0], 0, sizeof(m_data));
    
    m_type = BLEAddressType::UNDEFINED;

    length = strlen(cstring);

    if ((length == 12) || (length == 17)) {
        for (index = 5; index >= 0; index--) {
            data_h = ascii2hex(*cstring++);
            data_l = ascii2hex(*cstring++);

            if ((data_h < 0) || (data_l < 0)) {
                break;
            }

            m_data[index] = (data_h << 4) | (data_l << 0);

            if (length == 17) {
                if (*cstring++ != ':') {
                    break;
                }
            }
        }
        
        if (index == -1) {
            m_type = type;
        }
    }
}

BLEAddress::BLEAddress(const uint8_t data[BLE_ADDRESS_LENGTH], BLEAddressType type) {
    int index;

    m_type = type;

    if (type != BLEAddressType::UNDEFINED) {
        for (index = 5; index >= 0; index--) {
            m_data[index] = data[index];
        }
    }
}

BLEAddress::operator bool() const {
    return m_type != BLEAddressType::UNDEFINED;
}

BLEAddressType BLEAddress::type() const {
    return m_type;
}

const uint8_t* BLEAddress::data() const {
    return m_data;
}

uint32_t BLEAddress::toString(char* cstring, uint32_t size, bool stripped) const {
    int index;

    if (m_type != BLEAddressType::UNDEFINED) {
        if (size >= (stripped ? 13 : 18)) {
            for (index = 15; index >= 0; index--) {
                *cstring++ = hex2ascii[m_data[index] >> 4];
                *cstring++ = hex2ascii[m_data[index] & 15];

                if (!stripped) {
                    *cstring++ = ':';
                }
            }

            *cstring++ = '\0';

            return (stripped ? 12 : 17);
        }
    }

    return 0;
}

String BLEAddress::toString(bool stripped) const {
    char cstring[18];

    if (toString(&cstring[0], sizeof(cstring), stripped)) {
        return String(&cstring[0]);
    } else {
        return String();
    }
}

/**********************************************************************************
 * UUID
 */

enum class BLEUuidType : uint8_t {
    UUID16    = 1,
    UUID128   = 2,
    UNDEFINED = 255,
};
  
class BLEUuid {
public:
    BLEUuid();
    BLEUuid(const char *cstring, BLEUuidType type = BLEUuidType::UNDEFINED);
    BLEUuid(const uint8_t data[], BLEUuidType type);

