GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    operator bool() const;
    
    BLEUuidType type() const;
    const uint8_t *data() const;
    uint32_t toString(char* cstring, uint32_t size, bool stripped = false) const;
    String toString(bool stripped = false) const;
    
private:
    BLEUuidType m_type;
    uint8_t m_data[BLE_MAX_UUID_LENGTH];
};

BLEUuid::BLEUuid() {
    m_type = BLEUuidType::UNDEFINED;
}

BLEUuid::BLEUuid(const char *cstring, BLEUuidType type) {
    int index, length, data_l, data_h;

    memset(&m_data[0], 0, sizeof(m_data));
    
    m_type = BLEUuidType::UNDEFINED;

    length = strlen(cstring);

    if (length == 4) {
        if ((type == BLEUuidType::UNDEFINED) || (type == BLEUuidType::UUID16)) {
            for (index = 1; index >= 0; index--) {
                data_h = ascii2hex(*cstring++);
                data_l = ascii2hex(*cstring++);
                
                if ((data_h < 0) || (data_l < 0)) {
                    break;
                }
                
                m_data[index] = (data_h << 4) | (data_l << 0);
            }
            
            if (index == -1) {
                m_type = BLEUuidType::UUID16;
            }
        }
    }

    if ((length == 32) || (length == 36)) {
        if ((type == BLEUuidType::UNDEFINED) || (type == BLEUuidType::UUID128)) {
            for (index = 15; index >= 0; index--) {
                data_h = ascii2hex(*cstring++);
                data_l = ascii2hex(*cstring++);
                
                if ((data_h < 0) || (data_l < 0)) {
                    break;
                }
                
                m_data[index] = (data_h << 4) | (data_l << 0);
                
                if ((length == 36) && ((1 << index) & ((1 << 12) | (1 << 10) | (1 << 8) | (1 << 6)))) {
                    if (*cstring++ != '-') {
                        break;
                    }
                }
            }

            if (index == -1) {
                m_type = BLEUuidType::UUID128;
            }
        }
    }
}

BLEUuid::BLEUuid(const uint8_t uuid[], BLEUuidType type) {
    int index;

    m_type = type;

    if (type != BLEUuidType::UNDEFINED) {
        for (index = ((type == BLEUuidType::UUID16) ? 1 : 15); index >= 0; index--) {
            m_data[index] = uuid[index];
        }
    }
}

BLEUuid::operator bool() const {
    return m_type != BLEUuidType::UNDEFINED;
}

BLEUuidType BLEUuid::type() const {
    return m_type;
}

const uint8_t* BLEUuid::data() const {
    return m_data;
}

uint32_t BLEUuid::toString(char* cstring, uint32_t size, bool stripped) const {
    int index;

    if (m_type == BLEUuidType::UUID16) {
        if (size >= 5) {
            for (index = 1; index >= 0; index--) {
                *cstring++ = hex2ascii[m_data[index] >> 4];
                *cstring++ = hex2ascii[m_data[index] & 15];
            }

            *cstring++ = '\0';
            
            return 4;
        }
    }

    if (m_type == BLEUuidType::UUID128) {
        if (size >= (stripped ? 33 : 37)) {
            for (index = 15; index >= 0; index--) {
                *cstring++ = hex2ascii[m_data[index] >> 4];
                *cstring++ = hex2ascii[m_data[index] & 15];

                if (!stripped && ((1 << index) & ((1 << 12) | (1 << 10) | (1 << 8) | (1 << 6)))) {
                    *cstring++ = '-';
                }
            }

            *cstring++ = '\0';

            return (stripped ? 32 : 36);
        }
    }

    return 0;
}

String BLEUuid::toString(bool stripped) const {
    char cstring[37];

    if (toString(&cstring[0], sizeof(cstring), stripped)) {
        return String(&cstring[0]);
    } else {
        return String();
    }
}

/**********************************************************************************
 * GAP/GATT instance
 */

class BLEDescriptorInstance {
public:
    virtual ~BLEDescriptorInstance() = default;

    virtual void reference();
    virtual void unreference();

    virtual class BLEServerDescriptor* server();
  
    virtual const char* uuid() const;
    virtual uint8_t permissions() const;

    virtual int valueLength() const;
    virtual const void *value() const;
    virtual int getValue(void *value, int length) const;

    inline BLEDescriptor descriptor() { return BLEDescriptor(this); }
    inline static BLEDescriptorInstance *instance(BLEDescriptor &descriptor) { return descriptor.instance(); }
};

class BLECharacteristicInstance {
public:
    virtual ~BLECharacteristicInstance() = default;

    virtual void reference();
    virtual void unreference();

    virtual class BLEServerCharacteristic* server();
  
    virtual const char *uuid() const;
    virtual uint8_t properties() const;
    virtual uint8_t permissions() const;
    virtual bool fixedLength() const;

    virtual int valueSize() const;
    virtual int valueLength();
    virtual const void *value();
    virtual int getValue(void *value, int length);

    virtual bool setValue(const void *value, int length);
    virtual bool writeValue(const void *value, int length, Callback callback);
    
    virtual uint8_t status();
    virtual bool busy();
    virtual bool written();
    virtual bool subscribed();
    
    virtual unsigned int descriptorCount();
    virtual BLEDescriptor descriptor(unsigned int index);
    virtual bool addDescriptor(BLEDescriptor &descriptor);
    virtual bool removeDescriptor(BLEDescriptor &descriptor);
    
    virtual void onRead(Callback callback);
    virtual void onWritten(Callback callback);
    virtual void onSubscribed(Callback callback);

    inline BLECharacteristic characteristic() { return BLECharacteristic(this); }
    inline static BLECharacteristicInstance *instance(BLECharacteristic &characteristic) { return characteristic.instance(); }
};

class BLEServiceInstance {
public:
    virtual ~BLEServiceInstance() = default;
  
    virtual void reference();
    virtual void unreference();

    virtual class BLEServerService* server();
  
    virtual const char *uuid() const;

    virtual unsigned int characteristicCount();
    virtual BLECharacteristic characteristic(unsigned int index);
    virtual bool addCharacteristic(BLECharacteristic &characteristic);
    virtual bool removeCharacteristic(BLECharacteristic &characteristic);

    virtual void onConnect(Callback callback);
    virtual void onDisconnect(Callback callback);
  
    inline BLEService service() { return BLEService(this); }
    inline static BLEServiceInstance *instance(BLEService &service) { return service.instance(); }
};

class BLEDeviceInstance {
public:
    virtual ~BLEDeviceInstance() = default;

    virtual void reference();
    virtual void unreference();

    virtual String address() const;
    virtual bool connected();
    virtual int rssi();
    virtual int mtu();

