GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    virtual bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    virtual void getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout);  

    virtual void onConnectionUpdate(Callback callback);

    inline BLEDevice device() { return BLEDevice(this); }
    inline static BLEDeviceInstance *instance(BLEDevice &device) { return device.instance(); }
};

static BLEDescriptorInstance BLENullDescriptor;
static BLECharacteristicInstance BLENullCharacteristic;
static BLEServiceInstance BLENullService;
static BLEDeviceInstance BLENullDevice;


/**********************************************************************************
 * GATT client
 */



/**********************************************************************************
 * GATT server
 */

class BLEServerDescriptor final : public BLEDescriptorInstance {
public:
    BLEServerDescriptor(const char *uuid, uint8_t permissions, uint8_t *value, int valueLength);
    ~BLEServerDescriptor() override;

    void reference() override;
    void unreference() override;

    class BLEServerDescriptor* server() override;
    
    const char *uuid() const override;
    uint8_t permissions() const override;

    int valueLength() const override;
    const void *value() const override;
    int getValue(void *value, int length) const override;
    
private:
    volatile uint32_t m_refcount;


protected:
    const char * const m_uuid;
    const uint8_t m_permissions;
 
    const uint8_t * m_value;
    const uint16_t m_value_length;

    struct {
        uint16_t handle;
        class BLEServerCharacteristic *parent;
        class BLEServerDescriptor *sibling;
    } m_server;
    
    friend class BLELocalDevice;
    friend class BLEServerService;
    friend class BLEServerCharacteristic;
};

class BLEServerCharacteristic final : public BLECharacteristicInstance {
public:
    BLEServerCharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, uint8_t *value, int valueLength, int valueSize, bool fixedLength, bool constant);
    ~BLEServerCharacteristic() override;

    void reference() override;
    void unreference() override;

    class BLEServerCharacteristic* server() override;
    
    const char *uuid() const override;
    uint8_t properties() const override;
    uint8_t permissions() const override;
    bool fixedLength() const override;

    int valueSize() const override;
    int valueLength() override;
    const void *value() override;
    int getValue(void *value, int length) override;

    bool setValue(const void *value, int length) override;
    bool writeValue(const void *value, int length, Callback callback) override;
    
    bool busy() override;
    bool written() override;
    bool subscribed() override;

    unsigned int descriptorCount() override;
    BLEDescriptor descriptor(unsigned int index) override;
    bool addDescriptor(BLEDescriptor &descriptor) override;
    bool removeDescriptor(BLEDescriptor &descriptor) override;
    
    void onRead(Callback callback) override;
    void onWritten(Callback callback) override;
    void onSubscribed(Callback callback) override;

private:
    volatile uint32_t m_refcount;
  
protected:
    const char * const m_uuid;
    const uint8_t m_properties;
    const uint8_t m_permissions : 6;
    const uint8_t m_constant : 1;
    const uint8_t m_fixed_length : 1;

    volatile uint8_t m_subscribed : 2;
    volatile uint8_t m_update_type : 2;
    volatile uint8_t m_update_value : 1;
    volatile uint8_t m_sync_value : 1;
    volatile uint8_t m_sync_subscribed : 1;
    
    volatile uint8_t m_status;
    volatile uint16_t m_written;
    
    uint8_t * const m_value;
    uint16_t m_value_length;
    const uint16_t m_value_size;

    Callback m_done_callback;

    Callback m_read_callback;
    Callback m_written_callback;
    Callback m_subscribed_callback;

    struct {
        uint16_t handle;
        uint16_t count;
        class BLEServerService *parent;
        class BLEServerCharacteristic *sibling;
        class BLEServerDescriptor *children;
    } m_server;

    struct {
        class BLEServerCharacteristic * volatile request;
    } m_process;
    
    friend class BLELocalDevice;
    friend class BLEServerService;
    friend class BLEServerDescriptor;
};

class BLEServerService final : public BLEServiceInstance {
public:
    BLEServerService(const char *uuid);
    ~BLEServerService() override;

    void reference() override;
    void unreference() override;

    class BLEServerService* server() override;
    
    const char *uuid() const override;

    unsigned int characteristicCount() override;
    BLECharacteristic characteristic(unsigned int index) override;
    bool addCharacteristic(BLECharacteristic &characteristic) override;
    bool removeCharacteristic(BLECharacteristic &characteristic) override;

    void onConnect(Callback callback) override;
    void onDisconnect(Callback callback) override;

private:
    volatile uint32_t m_refcount;

protected:
    const char * const m_uuid;

    Callback m_connect_callback;
    Callback m_disconnect_callback;
    
    struct {
        uint16_t handle;
        uint16_t count;
        uint16_t attrib[2];
        class BLEServerService *sibling;
        class BLEServerCharacteristic *children;
    } m_server;
    
    friend class BLELocalDevice;
    friend class BLEServerCharacteristic;
    friend class BLEServerDescriptor;
};


/**********************************************************************************
 * GAP peer
 */

class BLEPeerDevice final : public BLEDeviceInstance {
public:
    BLEPeerDevice();
    BLEPeerDevice(uint16_t handle, const uint8_t *address, uint8_t type, uint16_t connectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    ~BLEPeerDevice() override;

    void reference() override;
    void unreference() override;
    
    String address() const override;
    bool connected() override;
    int rssi() override;
    int mtu() override;

