GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) override;
    void getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout) override; 

    void onConnectionUpdate(Callback callback) override;
    
private:
    volatile uint32_t m_refcount;

protected:
    uint16_t m_handle;
    BLEAddress m_address;
    uint16_t m_mtu;
    uint16_t m_connection_interval;
    uint16_t m_slave_latency;
    uint16_t m_supervision_timeout;
    
    Callback m_connection_update_callback;

    friend class BLELocalDevice;
};


/**********************************************************************************
 * GAP host
 */

class BLELocalDevice {
public:
    BLELocalDevice();
    ~BLELocalDevice() { };

    inline bool begin(int mtu, uint32_t options);
    inline void end();
    
    inline String address() const;
    
    inline bool setTxPowerLevel(int txPower);
    inline bool setPreferredPhy(BLEPhy txPhy, BLEPhy rxPhy, BLEPhyOption options);

    inline void setDeviceName(const char *deviceName);
    inline void setAppearance(enum BLEAppearance appearance);
    inline bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    
    inline unsigned int serviceCount();
    inline BLEService service(unsigned int index);
    inline bool addService(BLEService &service);
    inline bool removeService(BLEService &service);

    inline bool setSecurity(BLESecurity security);
    inline bool setBonding(bool bonding);
    inline bool setPin(const char *pin);
    inline void clearBondStorage();
    
    inline bool setIncludeTxPowerLevel(bool enable);
    inline bool setIncludeConnectionInterval(bool enable);
    inline bool setLocalName(const char *localName);
    inline bool setAdvertisedServiceUuids(const char *uuids[], int count, bool complete = true);
    inline bool setManufacturerData(const uint8_t data[], int length);
    inline bool setBeacon(const char *uuid, uint16_t major, uint16_t minor, int8_t rssi);
    inline bool setAdvertisingData(const uint8_t data[], int length);
    inline bool setScanResponseData(const uint8_t data[], int length);

    inline bool setAdvertisingInterval(uint16_t minimumAdvertisingInterval, uint16_t maximumAdvertisingInterval);
    inline void setConnectable(bool connectable);
    inline void setDiscoverable(BLEDiscoverable discoverable);

    inline bool advertise();
    inline void stopAdvertise();
    inline bool advertising();
    
    inline BLEDevice central();
    inline bool connected();
    inline void disconnect();

    inline void onStop(Callback callback);
    inline void onConnect(Callback callback);
    inline void onDisconnect(Callback callback);

    inline bool testTransmit(int channel, int length, BLEPayload payload,  BLEPhy phy = BLE_PHY_1M);
    inline bool testReceive(int channel, BLEPhy phy = BLE_PHY_1M, int modulation = 0);
    inline uint32_t testStop();
    inline bool testing();
  
private:
    bool m_reset;

    uint8_t m_mtu;
    uint32_t m_options;
    
    BLEAddress m_address;

    const char *m_device_name;
    uint16_t m_device_name_length;
    uint16_t m_appearance;
    struct {
        uint16_t connection_interval_min;
        uint16_t connection_interval_max;
        uint16_t slave_latency;
        uint16_t supervision_timeout;
    } m_ppcp;
    uint8_t m_pa_level;
    int8_t m_tx_power_level;
    uint8_t m_tx_phy;
    uint8_t m_rx_phy;
    uint16_t m_phy_options;
    
    uint16_t m_gap_service_handle;
    uint16_t m_device_name_handle;
    uint16_t m_appearance_handle;
    uint16_t m_ppcp_handle;
    
    Callback m_stop_callback;
    Callback m_connect_callback;
    Callback m_disconnect_callback;

    BLEPeerDevice *m_central;
    
    struct {
        BLESecurity security;
        uint16_t count;
        BLEServerService *children;
    } m_server;

    struct {
        uint8_t testing;
        bool advertising;
        bool bonding;
        BLESecurity security;
        uint32_t fixed_pin;
        bool connectable;
        BLEDiscoverable discoverable;
        uint16_t advertising_interval_min;
        uint16_t advertising_interval_max;
    } m_peripheral;
  
    struct {
        uint8_t data_length;
        uint8_t local_name_length;
        uint8_t service_uuids_length;
        uint8_t connection_interval_length;
        uint8_t tx_power_level_length;
        uint8_t manufacturer_data_length;
        uint8_t custom_length;
        uint8_t data[MAX_ADV_DATA_LEN];
        uint8_t scan_response_data_length;
        uint8_t scan_response_data[MAX_ADV_DATA_LEN];
    } m_advertising;

    struct {
        volatile uint32_t sequence;
        uint16_t connection;
        volatile uint16_t connection_interval_min;
        volatile uint16_t connection_interval_max;
        volatile uint16_t slave_latency;
        volatile uint16_t supervision_timeout;

        bool published;
        uint8_t service_count;
        BLEServerService *service_table[BLE_NUM_GATT_SERVICES];
        
        BLEServerCharacteristic *request_head;
        BLEServerCharacteristic *request_tail;
        BLEServerCharacteristic *request_current;
        BLEServerCharacteristic * volatile request_submit;
        uint16_t request_offset;
        uint16_t request_count;
        uint16_t request_length;

        volatile bool sync_value;
        BLEServerCharacteristic *value_current;
        uint16_t value_offset;
        uint16_t value_count;
        uint16_t value_length;

        volatile bool sync_subscribed;
        BLEServerCharacteristic *subscribed_current;
        
        stm32wb_ipcc_ble_command_t command;
        uint8_t data[256];
        k_work_t work;
    } m_process;

    void reset();
    bool publish();
    bool insert(BLEServerService *service); 
    void remove(BLEServerService *service); 
    void request(BLEServerCharacteristic *request); 
    BLEPeerDevice *complete(uint16_t handle, const uint8_t *address, uint8_t type, uint16_t connectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    void terminate();
    void connection(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    void phy(BLEPhy txPhy, BLEPhy rxPhy);
    void process();
    void done();
    void event();

    friend class BLEServerService;
    friend class BLEServerCharacteristic;
    friend class BLEServerDescriptor;
    friend class BLEPeerDevice;
};

