GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
static BLELocalDevice BLEHost;


/**********************************************************************************
 * GAP/GATT instance
 */

void BLEDescriptorInstance::reference() {
}

void BLEDescriptorInstance::unreference() {
}

class BLEServerDescriptor* BLEDescriptorInstance::server() {
    return nullptr;
}

const char *BLEDescriptorInstance::uuid() const {
    return nullptr;
}

uint8_t BLEDescriptorInstance::permissions() const {
    return 0;
}

int BLEDescriptorInstance::valueLength() const {
    return 0;
}

const void * BLEDescriptorInstance::value() const {
    return nullptr;
}

int BLEDescriptorInstance::getValue(void *value __attribute__((unused)), int length __attribute__((unused))) const {
    return 0;
}


void BLECharacteristicInstance::reference() {
}

void BLECharacteristicInstance::unreference() {
}

class BLEServerCharacteristic* BLECharacteristicInstance::server() {
    return nullptr;
}

const char *BLECharacteristicInstance::uuid() const {
    return nullptr;
}

uint8_t BLECharacteristicInstance::properties() const {
    return 0;
}

uint8_t BLECharacteristicInstance::permissions() const {
    return 0;
}

bool BLECharacteristicInstance::fixedLength() const {
    return false;
}

int BLECharacteristicInstance::valueSize() const {
    return 0;
}

int BLECharacteristicInstance::valueLength() {
    return 0;
}

const void * BLECharacteristicInstance::value() {
    return nullptr;
}

int BLECharacteristicInstance::getValue(void *value __attribute__((unused)), int length __attribute__((unused))) {
    return 0;
}

bool BLECharacteristicInstance::setValue(const void *value __attribute__((unused)), int length __attribute__((unused))) {
    return false;
}

bool BLECharacteristicInstance::writeValue(const void *value __attribute__((unused)), int length __attribute__((unused)), Callback callback __attribute__((unused))) {
    return false;
}

uint8_t BLECharacteristicInstance::status() {
    return BLE_STATUS_SUCCESS;
}

bool BLECharacteristicInstance::busy() {
    return false;
}

bool BLECharacteristicInstance::written() {
    return false;
}

bool BLECharacteristicInstance::subscribed() {
    return false;
}

unsigned int BLECharacteristicInstance::descriptorCount() {
    return 0;
}

BLEDescriptor BLECharacteristicInstance::descriptor(unsigned int index __attribute__((unused))) {
    return BLEDescriptor();
}

bool BLECharacteristicInstance::addDescriptor(BLEDescriptor &descriptor __attribute__((unused))) {
    return false;
}

bool BLECharacteristicInstance::removeDescriptor(BLEDescriptor &descriptor __attribute__((unused))) {
    return false;
}

void BLECharacteristicInstance::onRead(Callback callback __attribute__((unused))) {
}

void BLECharacteristicInstance::onWritten(Callback callback __attribute__((unused))) {
}

void BLECharacteristicInstance::onSubscribed(Callback callback __attribute__((unused))) {
}


void BLEServiceInstance::reference() {
}

void BLEServiceInstance::unreference() {
}

class BLEServerService* BLEServiceInstance::server() {
    return nullptr;
}

const char *BLEServiceInstance::uuid() const {
    return nullptr;
}

unsigned int BLEServiceInstance::characteristicCount() {
    return 0;
}

BLECharacteristic BLEServiceInstance::characteristic(unsigned int index __attribute__((unused))) {
    return BLECharacteristic();
}

bool BLEServiceInstance::addCharacteristic(BLECharacteristic &characteristic __attribute__((unused))) {
    return false;
}

bool BLEServiceInstance::removeCharacteristic(BLECharacteristic &characteristic __attribute__((unused))) {
    return false;
}

void BLEServiceInstance::onConnect(Callback callback __attribute__((unused))) {
}

void BLEServiceInstance::onDisconnect(Callback callback __attribute__((unused))) {
}


void BLEDeviceInstance::reference() {
}

void BLEDeviceInstance::unreference() {
}

String BLEDeviceInstance::address() const {
    return String();
}

bool BLEDeviceInstance::connected() {
    return 0;
}

int BLEDeviceInstance::rssi() {
    return 0;
}

int BLEDeviceInstance::mtu() {
    return 0;
}

bool BLEDeviceInstance::setConnectionParameters(uint16_t minimumConnectionInterval __attribute__((unused)), uint16_t maximumConnectionInterval __attribute__((unused)), uint16_t slaveLatency __attribute__((unused)), uint16_t supervisionTimeout __attribute__((unused))) {
    return false;
}

void BLEDeviceInstance::getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout) {
    connectionInterval = 0;
    slaveLatency = 0;
    supervisionTimeout = 0;
}

void BLEDeviceInstance::onConnectionUpdate(Callback callback __attribute__((unused))) {
}

/**********************************************************************************
 * GATT client
 */



/**********************************************************************************
 * GATT server
 */

BLEServerDescriptor::BLEServerDescriptor(const char *uuid, uint8_t permissions, uint8_t *value, int valueLength) :
    m_uuid(uuid),
    m_permissions(permissions),
    m_value(value),
    m_value_length(valueLength)
{
    m_refcount = 1;

    m_server.handle = 0;
    m_server.parent = nullptr;
    m_server.sibling = nullptr;
}

BLEServerDescriptor::~BLEServerDescriptor() {
    deallocate_noconst(const_cast<char*>(m_uuid));
    deallocate_noconst(m_value);
}

void BLEServerDescriptor::reference() {
    __armv7m_atomic_inc(&m_refcount, 0xffffffff);
}

void BLEServerDescriptor::unreference() {
    if (__armv7m_atomic_dec(&m_refcount) == 1) {
        delete this;
    }
}

class BLEServerDescriptor* BLEServerDescriptor::server() {
    return this;
}

const char *BLEServerDescriptor::uuid() const {
    return m_uuid;
}

uint8_t BLEServerDescriptor::permissions() const {
    return m_permissions;
}

int BLEServerDescriptor::valueLength() const {
    return m_value_length;
}

const void * BLEServerDescriptor::value() const {
    return m_value;
}

int BLEServerDescriptor::getValue(void *value, int length) const {
    if (length > m_value_length) {
        length = m_value_length;
    }

    memcpy(value, &m_value[0], length);

