GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    return length;
}


BLEServerCharacteristic::BLEServerCharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, uint8_t *value, int valueLength, int valueSize, bool fixedLength, bool constant) :
    m_uuid(uuid),
    m_properties(properties),
    m_permissions(permissions),
    m_constant(constant),
    m_fixed_length(fixedLength),
    m_value(value),
    m_value_length(valueLength),
    m_value_size(valueSize)
{
    m_refcount = 1;

    m_subscribed = 0;
    m_update_type = 0;
    m_update_value = false;
    m_sync_value = false;
    m_sync_subscribed = false;
    
    m_status = BLE_STATUS_SUCCESS;
    m_written = 0;

    m_done_callback = Callback();
    m_read_callback = Callback();
    m_written_callback = Callback();
    m_subscribed_callback = Callback();
    
    m_server.handle = 0;
    m_server.count = 0;
    m_server.parent = nullptr;
    m_server.sibling = nullptr;
    m_server.children = nullptr;

    m_process.request = nullptr;
}

BLEServerCharacteristic::~BLEServerCharacteristic() {
    deallocate_noconst(const_cast<char*>(m_uuid));
    deallocate_noconst(const_cast<uint8_t*>(m_value));
}

void BLEServerCharacteristic::reference() {
    __armv7m_atomic_inc(&m_refcount, 0xffffffff);
}

void BLEServerCharacteristic::unreference() {
    if (__armv7m_atomic_dec(&m_refcount) == 1) {
        delete this;
    }
}

class BLEServerCharacteristic* BLEServerCharacteristic::server() {
    return this;
}
    
const char *BLEServerCharacteristic::uuid() const {
    return m_uuid;
}

uint8_t BLEServerCharacteristic::properties() const {
    return m_properties;
}

uint8_t BLEServerCharacteristic::permissions() const {
    return m_permissions;
}

bool BLEServerCharacteristic::fixedLength() const {
    return m_fixed_length;
}

int BLEServerCharacteristic::valueSize() const {
    return m_value_size;
}

int BLEServerCharacteristic::valueLength() {
    return m_value_length;
}

const void * BLEServerCharacteristic::value() {
    return m_value;
}

int BLEServerCharacteristic::getValue(void *value, int length) {
    if (length > m_value_length) {
        length = m_value_length;
    }

    memcpy(value, &m_value[0], length);

    return length;
}
  
bool BLEServerCharacteristic::setValue(const void *value, int length) {
    uint8_t status;
    
    if (m_constant) {
        return false;
    }
    
    if (m_fixed_length) {
        if (length != m_value_size) {
            return false;
        }
    } else {
        if (length > m_value_size) {
            return false;
        }
    }

    status = armv7m_atomic_swapb((volatile uint8_t*)&m_status, BLE_STATUS_BUSY);
    
    if (status == BLE_STATUS_BUSY) {
        return false;
    }
    
    if (m_written & 0x8000) {
        m_status = status;
        
        return false;
    }

    m_value_length = length;
    
    memcpy(&m_value[0], value, length);

    m_update_value = true;

    m_status = status;
    
    return true;
}

bool BLEServerCharacteristic::writeValue(const void *value, int length, Callback callback) {
    uint8_t status;

    if (m_constant) {
        return false;
    }

    if (m_fixed_length) {
        if (length != m_value_size) {
            return false;
        }
    } else {
        if (length > m_value_size) {
            return false;
        }
    }

    status = armv7m_atomic_swapb((volatile uint8_t*)&m_status, BLE_STATUS_BUSY);
    
    if (status == BLE_STATUS_BUSY) {
        return false;
    }
    
    if (m_written & 0x8000) {
        m_status = status;
        
        return false;
    }

    m_value_length = length;
    
    memcpy(&m_value[0], value, length);
    
    m_update_value = true;

    m_update_type = m_subscribed;
    m_update_value = false;
    
    m_done_callback = callback;
        
    BLEHost.request(this);

    return true;
}

bool BLEServerCharacteristic::busy() {
    return (m_status == BLE_STATUS_BUSY);
}

bool BLEServerCharacteristic::written() {
    if (!m_written) {
        return false;
    }

    do {
        m_value_length = armv7m_atomic_swaph(&m_written, 0x0000) & ~0x8000;
    
        memcpy(&m_value[0], (void*)&m_value[m_value_size], m_value_length);
    } while (m_written);

    return true;
}

bool BLEServerCharacteristic::subscribed() {
    return !!m_subscribed;
}
    
unsigned int BLEServerCharacteristic::descriptorCount() {
    return m_server.count;
}

BLEDescriptor BLEServerCharacteristic::descriptor(unsigned int index) {
    class BLEServerDescriptor *serverDescriptor;
    unsigned int n;
    
    if (index >= m_server.count) {
        return BLEDescriptor();
    }

    for (serverDescriptor = m_server.children, n = 0; n < index; n++) {
        serverDescriptor = serverDescriptor->m_server.sibling;
    }

    return serverDescriptor->descriptor();
}

bool BLEServerCharacteristic::addDescriptor(BLEDescriptor &descriptor) {
    class BLEServerDescriptor *serverDescriptor, *currentDescriptor, **previousDescriptor;

    if (m_server.parent) {
        return false;
    }
    
    serverDescriptor = BLEDescriptorInstance::instance(descriptor)->server();

    if (!serverDescriptor) {
        return false;
    }
    
    if (serverDescriptor->m_server.parent) {
        return false;
    }

    serverDescriptor->reference();
    
    serverDescriptor->m_server.parent = this;

    for (previousDescriptor = &m_server.children, currentDescriptor = *previousDescriptor;
         currentDescriptor;
         previousDescriptor = &currentDescriptor->m_server.sibling, currentDescriptor = *previousDescriptor)
    {
    }

    *previousDescriptor = serverDescriptor;

    m_server.count++;
    
    return true;
}

bool BLEServerCharacteristic::removeDescriptor(BLEDescriptor &descriptor) {
    class BLEServerDescriptor *serverDescriptor, *currentDescriptor, **previousDescriptor;

    if (m_server.parent) {
        return false;
    }
    
    serverDescriptor = BLEDescriptorInstance::instance(descriptor)->server();

    if (!serverDescriptor) {
        return false;
    }
    
    if (serverDescriptor->m_server.parent != this) {
        return false;
    }

    m_server.count--;

    for (previousDescriptor = &m_server.children, currentDescriptor = *previousDescriptor;
         currentDescriptor;
         previousDescriptor = &currentDescriptor->m_server.sibling, currentDescriptor = *previousDescriptor)
    {
        if (currentDescriptor == serverDescriptor) {
            *previousDescriptor = serverDescriptor->m_server.sibling;
            break;
        }
    }

    serverDescriptor->m_server.parent = NULL;
        
    serverDescriptor->unreference();

