GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    return true;
}

void BLEServerCharacteristic::onRead(Callback callback) {
    m_read_callback = callback;
}

void BLEServerCharacteristic::onWritten(Callback callback) {
    m_written_callback = callback;
}

void BLEServerCharacteristic::onSubscribed(Callback callback) {
    m_subscribed_callback = callback;
}

BLEServerService::BLEServerService(const char *uuid) :
    m_uuid(uuid)
{
    m_refcount = 1;

    m_connect_callback = Callback();
    m_disconnect_callback = Callback();
    
    m_server.handle = 0;
    m_server.count = 0;
    m_server.attrib[0] = 0;
    m_server.attrib[1] = 0;
    m_server.sibling = nullptr;
    m_server.children = nullptr;
}

BLEServerService::~BLEServerService() {
    deallocate_noconst(const_cast<char*>(m_uuid));
}

void BLEServerService::reference() {
    __armv7m_atomic_inc(&m_refcount, 0xffffffff);
}

void BLEServerService::unreference() {
    if (__armv7m_atomic_dec(&m_refcount) == 1) {
        delete this;
    }
}

class BLEServerService* BLEServerService::server() {
    return this;
}

const char *BLEServerService::uuid() const {
    return m_uuid;
}

unsigned int BLEServerService::characteristicCount() {
    return m_server.count;
}

BLECharacteristic BLEServerService::characteristic(unsigned int index) {
    class BLEServerCharacteristic *serverCharacteristic;
    unsigned int n;
    
    if (index >= m_server.count) {
        return BLECharacteristic();
    }

    for (serverCharacteristic = m_server.children, n = 0; n < index; n++) {
        serverCharacteristic = serverCharacteristic->m_server.sibling;
    }

    return serverCharacteristic->characteristic();
}

bool BLEServerService::addCharacteristic(BLECharacteristic &characteristic) {
    class BLEServerCharacteristic *serverCharacteristic, *currentCharacteristic, **previousCharacteristic;

    if (m_server.attrib[0]) {
        return false;
    }
    
    serverCharacteristic = BLECharacteristicInstance::instance(characteristic)->server();

    if (!serverCharacteristic) {
        return false;
    }
    
    if (serverCharacteristic->m_server.parent) {
        return false;
    }

    serverCharacteristic->reference();

    serverCharacteristic->m_server.parent = this;

    for (previousCharacteristic = &m_server.children, currentCharacteristic = *previousCharacteristic;
         currentCharacteristic;
         previousCharacteristic = &currentCharacteristic->m_server.sibling, currentCharacteristic = *previousCharacteristic)
    {
    }

    *previousCharacteristic = serverCharacteristic;

    m_server.count++;

    return true;
}

bool BLEServerService::removeCharacteristic(BLECharacteristic &characteristic) {
    class BLEServerCharacteristic *serverCharacteristic, *currentCharacteristic, **previousCharacteristic;

    if (m_server.attrib[0]) {
        return false;
    }
    
    serverCharacteristic = BLECharacteristicInstance::instance(characteristic)->server();

    if (!serverCharacteristic) {
        return false;
    }
    
    if (serverCharacteristic->m_server.parent != this) {
        return false;
    }

    m_server.count--;

    for (previousCharacteristic = &m_server.children, currentCharacteristic = *previousCharacteristic;
         currentCharacteristic;
         previousCharacteristic = &currentCharacteristic->m_server.sibling, currentCharacteristic = *previousCharacteristic)
    {
        if (currentCharacteristic == serverCharacteristic) {
            *previousCharacteristic = serverCharacteristic->m_server.sibling;
            break;
        }
    }

    serverCharacteristic->m_server.parent = NULL;
        
    serverCharacteristic->unreference();

    return true;
}

void BLEServerService::onConnect(Callback callback) {
    m_connect_callback = callback;
}

void BLEServerService::onDisconnect(Callback callback) {
    m_disconnect_callback = callback;
}

/**********************************************************************************
 * GAP peer
 */

BLEPeerDevice::BLEPeerDevice() {
    m_refcount = 1;

    m_handle = BLE_PEER_DEVICE_NOT_CONNECTED;
    m_address = BLEAddress();
    m_mtu = ATT_MTU;
    m_connection_interval = 0;
    m_slave_latency = 0;
    m_supervision_timeout = 0;

    m_connection_update_callback = Callback();
}

BLEPeerDevice::BLEPeerDevice(uint16_t handle, const uint8_t *address, uint8_t type, uint16_t connectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    m_refcount = 1;

    m_handle = handle;
    m_address = BLEAddress(address, (BLEAddressType)type);
    m_mtu = ATT_MTU;
    m_connection_interval = connectionInterval;
    m_slave_latency = slaveLatency;
    m_supervision_timeout = supervisionTimeout;

    m_connection_update_callback = Callback();
}

BLEPeerDevice::~BLEPeerDevice() {
}

void BLEPeerDevice::reference() {
    __armv7m_atomic_inc(&m_refcount, 0xffffffff);
}

void BLEPeerDevice::unreference() {
    if (__armv7m_atomic_dec(&m_refcount) == 1) {
        delete this;
    }
}

String BLEPeerDevice::address() const {
    return m_address.toString();
}

bool BLEPeerDevice::connected() {
    return (m_handle != BLE_PEER_DEVICE_NOT_CONNECTED);
}

int BLEPeerDevice::rssi() {
    tBleStatus status;
    int8_t rssi;

    status = hci_read_rssi(m_handle, (uint8_t*)&rssi);

    if ((status == BLE_STATUS_SUCCESS) && (rssi <= 0)) {
        return rssi;
    }

    return 0;
}

int BLEPeerDevice::mtu() {
    return m_mtu;
}

bool BLEPeerDevice::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    if (minimumConnectionInterval > maximumConnectionInterval) {
        return false;
    }
    
    if ((minimumConnectionInterval < 0x0006) || (minimumConnectionInterval > 0x0c80)) {
        return false;
    }

    if ((maximumConnectionInterval < 0x0006) || (maximumConnectionInterval > 0x0c80)) {
        return false;
    }

    if (slaveLatency > 0x01f3) {
        return false;
    }
    
    if ((supervisionTimeout < 0x000a) || (supervisionTimeout > 0x0c80)) {
        return false;
    }

