GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    BLEHost.connection(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);

    return true;
}

void BLEPeerDevice::getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout) {
    connectionInterval = m_connection_interval;
    slaveLatency = m_slave_latency;
    supervisionTimeout = m_supervision_timeout;
}

void BLEPeerDevice::onConnectionUpdate(Callback callback) {
    m_connection_update_callback = callback;
}


/**********************************************************************************
 * GAP host
 */

static const uint8_t ER[16] = { 0xfe,0xdc,0xba,0x09,0x87,0x65,0x43,0x21,0xfe,0xdc,0xba,0x09,0x87,0x65,0x43,0x21 };
static const uint8_t IR[16] = { 0x12,0x34,0x56,0x78,0x9a,0xbc,0xde,0xf0,0x12,0x34,0x56,0x78,0x9a,0xbc,0xde,0xf0 };

static void hci_done_req(k_task_t *task) {
    k_event_send(task, WIRING_EVENT_TRANSIENT);
}

int hci_send_req(stm32wb_ipcc_ble_command_t *command, bool async) {
    if (async) {
        return BLE_STATUS_ERROR;
    }

    command->next = NULL;
    command->rsize = command->rlen;
    command->callback = (stm32wb_ipcc_ble_command_callback_t)hci_done_req;
    command->context = k_task_self();

    if (!stm32wb_ipcc_ble_command(command)) {
        return BLE_STATUS_ERROR;
    }

    if (k_event_receive(WIRING_EVENT_TRANSIENT, (K_EVENT_ANY | K_EVENT_CLEAR), K_TIMEOUT_FOREVER, NULL) != K_NO_ERROR) {
        return BLE_STATUS_ERROR;
    }

    return (command->status == STM32WB_IPCC_BLE_COMMAND_STATUS_SUCCESS) ? BLE_STATUS_SUCCESS : BLE_STATUS_TIMEOUT;
}

BLELocalDevice::BLELocalDevice() {
    m_reset = true;

    m_address = BLEAddress();
    
    m_device_name = NULL;
    m_device_name_length = BLE_MIN_DEVICE_NAME_LENGTH;
    m_appearance = 0;
#if 0    
    m_ppcp.connection_interval_min = 0x0010; /* 20ms */
    m_ppcp.connection_interval_max = 0x0020; /* 40ms */
#endif
#if 1    
    m_ppcp.connection_interval_min = 0x0006; /* 20ms */
    m_ppcp.connection_interval_max = 0x0010; /* 40ms */
#endif    
    m_ppcp.slave_latency = 0x0000;
    m_ppcp.supervision_timeout = 0x00c8; /* 2000ms */
    m_pa_level = 0x19;
    m_tx_power_level = 0;
    m_tx_phy = BLE_PHY_1M;
    m_rx_phy = BLE_PHY_1M;
    m_phy_options = 0;

    m_stop_callback = Callback();
    m_connect_callback = Callback();
    m_disconnect_callback = Callback();

    m_server.count = 0;
    m_server.children = nullptr;

    m_peripheral.testing = BLE_TEST_MODE_NONE;
    m_peripheral.advertising = false;
    m_peripheral.bonding = false;
    m_peripheral.security = BLE_SECURITY_UNENCRYPTED;
    m_peripheral.fixed_pin = BLE_FIXED_PIN_UNDEFINED;
    m_peripheral.connectable = true;
    m_peripheral.discoverable = BLE_DISCOVERABLE_GENERAL;
    m_peripheral.advertising_interval_min = 0x0080; /*  80ms */
    m_peripheral.advertising_interval_max = 0x00a0; /* 100ms */

    m_advertising.data_length = 3;
    m_advertising.local_name_length = 0;
    m_advertising.service_uuids_length = 0;
    m_advertising.connection_interval_length = 0;
    m_advertising.tx_power_level_length = 0;
    m_advertising.manufacturer_data_length = 0;
    m_advertising.custom_length = 0;
    m_advertising.scan_response_data_length = 0;

    Callback done_callback = Callback(&BLELocalDevice::done, this);
    
    m_process.command.next = NULL;
    m_process.command.opcode = 0;
    m_process.command.event = 0;
    m_process.command.cparam = &m_process.data[0];
    m_process.command.rparam = &m_process.data[0];
    m_process.command.rsize = 255;
    m_process.command.status = STM32WB_IPCC_BLE_COMMAND_STATUS_SUCCESS;
    m_process.command.callback = done_callback.callback();
    m_process.command.context = done_callback.context();
    
    Callback process_callback = Callback(&BLELocalDevice::process, this);

    k_work_init(&m_process.work, process_callback.callback(), process_callback.context());
}

bool BLELocalDevice::begin(int mtu, uint32_t options) {
    tBleStatus status = BLE_STATUS_SUCCESS;
    uint16_t maxTxOctets, maxTxTime, maxRxOctets, maxRxTime;
    
    if (!m_reset) {
        return false;
    }
    
    if ((mtu < 23) || (mtu > 251)) {
        return false;
    }
    
    stm32wb_ipcc_ble_init_params_t init_params = {
        NULL,                                                                                          /* pBleBufferAddress          */
        0,                                                                                             /* BleBufferSize              */
        BLE_NUM_GATT_ATTRIBUTES,                                                                       /* NumAttrRecord              */
        BLE_NUM_GATT_SERVICES,                                                                         /* NumAttrServ                */
        BLE_ATT_VALUE_ARRAY_SIZE,                                                                      /* AttrValueArrSize           */
        BLE_NUM_LINK,                                                                                  /* NumOfLinks                 */
        BLE_DATA_LENGTH_EXTENSION,                                                                     /* ExtendedPacketLengthEnable */
        BLE_PREP_WRITE_X_ATT(BLE_DEFAULT_MAX_ATT_SIZE),                                                /* PrWriteListSize            */
        (uint8_t)BLE_MBLOCKS_CALC(BLE_PREP_WRITE_X_ATT(BLE_DEFAULT_MAX_ATT_SIZE), mtu, BLE_NUM_LINK),  /* MblockCount                */
        (uint8_t)mtu,                                                                                  /* AttMtu                     */
        BLE_SLAVE_SCA,                                                                                 /* SlaveSca                   */
        BLE_MASTER_SCA,                                                                                /* MasterSca                  */
        BLE_LSE_SOURCE,                                                                                /* LsSource                   */
        BLE_MAX_CONN_EVENT_LENGTH,                                                                     /* MaxConnEventLength         */
        BLE_HSE_STARTUP_TIME,                                                                          /* HsStartupTime              */
        BLE_VITERBI_MODE,                                                                              /* ViterbiEnable              */
        (uint8_t)(((options & BLE_OPTION_NO_SERVICE_CHANGED) ? BLE_OPTION_NO_SERVICE_CHANGED : 0) |    /* Options                    */
                  ((options & BLE_OPTION_READ_ONLY_DEVICE_NAME) ? BLE_OPTION_READ_ONLY_DEVICE_NAME : 0)),
        0,                                                                                             /* HwVersion                  */
        32,                                                                                            /* MaxCOCInitiatorNbr         */
        BLE_MIN_TX_POWER,                                                                              /* MinTxPower                 */
        BLE_MAX_TX_POWER,                                                                              /* MaxTxPower                 */
        BLE_RX_MODEL,                                                                                  /* RxModelConfig              */
        0,                                                                                             /* MaxAdvSetNbr               */
        0,                                                                                             /* MaxAdvDataLen              */
        BLE_TX_PATH_COMPENSATION,                                                                      /* TxPathCompensation         */
        BLE_RX_PATH_COMPENSATION                                                                       /* RxPacthCompensation        */
#if 0        
        BLE_CORE_VERSION_5_2,                                                                          /* BleCoreVersion             */
#endif
    };

    if (!stm32wb_ipcc_sys_enable()) {
        return false;
    }

