GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    Callback event_callback = Callback(&BLELocalDevice::event, this);
        
    if (!stm32wb_ipcc_ble_enable(&init_params, (stm32wb_ipcc_ble_event_callback_t)event_callback.callback(), event_callback.context())) {
        stm32wb_ipcc_sys_disable();
        
        return false;
    }
    
    status = hci_reset();
    
    if (status == BLE_STATUS_SUCCESS) {
        uint8_t address[BLE_ADDRESS_LENGTH];

        address[0] = *((const uint8_t*)(UID64_BASE + 0));
        address[1] = *((const uint8_t*)(UID64_BASE + 1));
        address[2] = *((const uint8_t*)(UID64_BASE + 2));
        address[3] = 0x26;
        address[4] = 0xe1;
        address[5] = 0x80;

        if (!(options & BLE_OPTION_RANDOM_STATIC_ADDRESS)) {
            m_address = BLEAddress(address, BLEAddressType::PUBLIC);
        }
        
        status = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, address);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, &ER[0]);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, &IR[0]);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        uint8_t address[BLE_ADDRESS_LENGTH];
        volatile uint8_t busy;

        stm32wb_random(&address[0], sizeof(address), &busy, NULL, NULL);
        
        while (busy == STM32WB_RANDOM_STATUS_BUSY) {
            __WFE();
        }

        address[5] |= 0xc0;
        
        if (options & BLE_OPTION_RANDOM_STATIC_ADDRESS) {
            m_address = BLEAddress(address, BLEAddressType::RANDOM_STATIC);
        }
        
        status = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, address);
    }

    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gatt_init();
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        if (m_device_name) {
            m_device_name_length = strlen(m_device_name);
            
            if (m_device_name_length < BLE_MIN_DEVICE_NAME_LENGTH) {
                m_device_name_length = BLE_MIN_DEVICE_NAME_LENGTH;
            }

            if (m_device_name_length > BLE_MAX_DEVICE_NAME_LENGTH) {
                m_device_name_length = BLE_MAX_DEVICE_NAME_LENGTH;
            }
        }
        
        status = aci_gap_init(GAP_PERIPHERAL_ROLE,
                              ((m_options & BLE_OPTION_PRIVACY) ? PRIVACY_ENABLED : PRIVACY_DISABLED),
                              m_device_name_length,
                              &m_gap_service_handle,
                              &m_device_name_handle,
                              &m_appearance_handle);
        
        if (status == BLE_STATUS_SUCCESS) {
            m_ppcp_handle = m_appearance_handle + 2;
        }
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gatt_update_char_value(m_gap_service_handle,
                                            m_device_name_handle,
                                            0,
                                            (m_device_name ? strlen(m_device_name) : 0),
                                            reinterpret_cast<const uint8_t*>(m_device_name));
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gatt_update_char_value(m_gap_service_handle,
                                            m_appearance_handle,
                                            0,
                                            2,
                                            reinterpret_cast<const uint8_t*>(&m_appearance));
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gatt_update_char_value(m_gap_service_handle,
                                            m_ppcp_handle,
                                            0,
                                            8,
                                            reinterpret_cast<const uint8_t*>(&m_ppcp));
    }

    if (status == BLE_STATUS_SUCCESS) {
        status = hci_le_set_default_phy(0, m_tx_phy, m_rx_phy);
    }


    if (status == BLE_STATUS_SUCCESS) {
        status = hci_le_read_maximum_data_length(&maxTxOctets, &maxTxTime, &maxRxOctets, &maxRxTime);
    }

    if (status == BLE_STATUS_SUCCESS) {
        if (mtu < (maxTxOctets - 4)) {
            maxTxOctets = mtu + 4;
            maxTxTime = (maxTxOctets + 14) * 8; 
        }

#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("SUGGESTED-DEFAULT-DATA-LENGTH %d/%d\r\n", maxTxOctets, maxTxTime);
#endif
        
        status = hci_le_write_suggested_default_data_length(maxTxOctets, maxTxTime);
    }

    if (status == BLE_STATUS_SUCCESS) {
        stm32wb_system_smps_configure(m_pa_level);

        status = aci_hal_set_tx_power_level(0, m_pa_level);
    }
    
    if (status != BLE_STATUS_SUCCESS) {
        aci_hal_stack_reset();

        stm32wb_ipcc_ble_disable();
        stm32wb_ipcc_sys_disable();

        return false;
    }

    m_reset = false;
    m_mtu = mtu;
    m_options = options;

    return true;
}

void BLELocalDevice::end() {
    if (!m_reset) {
        m_reset = true;

        aci_hal_stack_reset();

        stm32wb_ipcc_ble_disable();
        stm32wb_ipcc_sys_disable();
        
        reset();
    }
}

String BLELocalDevice::address() const {
    return m_address.toString();
}

bool BLELocalDevice::setTxPowerLevel(int txPower) {
    uint32_t advertising_data_offset;
    uint8_t pa_level, tx_power_level; 
    tBleStatus status;

    if      (txPower >=   6) { pa_level = 0x1f; tx_power_level =   6; }
    else if (txPower >=   5) { pa_level = 0x1e; tx_power_level =   5; }
    else if (txPower >=   4) { pa_level = 0x1d; tx_power_level =   4; }
    else if (txPower >=   3) { pa_level = 0x1c; tx_power_level =   3; }
    else if (txPower >=   2) { pa_level = 0x1b; tx_power_level =   2; }
    else if (txPower >=   1) { pa_level = 0x1a; tx_power_level =   1; }
    else if (txPower >=   0) { pa_level = 0x19; tx_power_level =   0; }
    else if (txPower >=  -1) { pa_level = 0x16; tx_power_level =  -1; }
    else if (txPower >=  -2) { pa_level = 0x14; tx_power_level =  -2; }
    else if (txPower >=  -3) { pa_level = 0x12; tx_power_level =  -3; }
    else if (txPower >=  -4) { pa_level = 0x11; tx_power_level =  -4; }
    else if (txPower >=  -5) { pa_level = 0x10; tx_power_level =  -5; }
    else if (txPower >=  -6) { pa_level = 0x0f; tx_power_level =  -6; }
    else if (txPower >=  -7) { pa_level = 0x0e; tx_power_level =  -7; }
    else if (txPower >=  -8) { pa_level = 0x0d; tx_power_level =  -8; }
    else if (txPower >=  -9) { pa_level = 0x0c; tx_power_level =  -9; }
    else if (txPower >= -10) { pa_level = 0x0b; tx_power_level = -10; }
    else if (txPower >= -11) { pa_level = 0x0a; tx_power_level = -11; }
    else if (txPower >= -12) { pa_level = 0x09; tx_power_level = -12; }
    else if (txPower >= -13) { pa_level = 0x08; tx_power_level = -13; }
    else if (txPower >= -14) { pa_level = 0x07; tx_power_level = -14; }
    else if (txPower >= -15) { pa_level = 0x06; tx_power_level = -15; }
    else if (txPower >= -16) { pa_level = 0x05; tx_power_level = -16; }
    else if (txPower >= -17) { pa_level = 0x04; tx_power_level = -17; }
    else if (txPower >= -18) { pa_level = 0x03; tx_power_level = -18; }
    else if (txPower >= -19) { pa_level = 0x02; tx_power_level = -19; }
    else if (txPower >= -20) { pa_level = 0x01; tx_power_level = -20; }
    else                     { pa_level = 0x00; tx_power_level = -40; }

