GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    if (!m_reset) {
        if (pa_level > m_pa_level) {
            stm32wb_system_smps_configure(pa_level);
        }

        status = aci_hal_set_tx_power_level(0, m_pa_level);

        if (status == BLE_STATUS_SUCCESS) {
            if (pa_level < m_pa_level) {
                stm32wb_system_smps_configure(pa_level);
            }

            m_pa_level = pa_level;
            m_tx_power_level = tx_power_level;

            if (m_advertising.tx_power_level_length) {
                advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length + m_advertising.connection_interval_length;

                m_advertising.data[advertising_data_offset+2] = m_tx_power_level;
                
                if (m_peripheral.advertising) {
                    status = hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data);
                }
            }
        }

        if (status != BLE_STATUS_SUCCESS) {
            return false;
        }
    } else {
        m_pa_level = pa_level;
        m_tx_power_level = tx_power_level;
    }

    return true;
}

bool BLELocalDevice::setPreferredPhy(BLEPhy txPhy, BLEPhy rxPhy, BLEPhyOption phyOptions) {
    tBleStatus status;

    if ((txPhy == BLE_PHY_CODED) || (rxPhy == BLE_PHY_CODED)) {
        return false;
    }

    m_tx_phy = txPhy;
    m_rx_phy = rxPhy;
    m_phy_options = phyOptions;

    if (!m_reset) {
        status = hci_le_set_default_phy(0, m_tx_phy, m_rx_phy);

        if (status != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return true;
}

void BLELocalDevice::setDeviceName(const char *deviceName) {
    uint32_t length = 0;
    
    if (m_device_name) {
        deallocate_noconst(m_device_name);

        m_device_name = NULL;
    }

    if (deviceName) {
        length = strlen(deviceName);

        m_device_name = (const char*)allocate_noconst(deviceName, length +1);
    }

    if (!m_reset) {
        if (length > m_device_name_length) {
            length = m_device_name_length;
        }

        aci_gatt_update_char_value(m_gap_service_handle,
                                   m_device_name_handle,
                                   0,
                                   length,
                                   reinterpret_cast<const uint8_t*>(m_device_name));
    }
}

void BLELocalDevice::setAppearance(enum BLEAppearance appearance) {
    m_appearance = (uint16_t)appearance;

    if (!m_reset) {
        aci_gatt_update_char_value(m_gap_service_handle,
                                   m_appearance_handle,
                                   0,
                                   2,
                                   reinterpret_cast<const uint8_t*>(&m_appearance));
    }
}

bool BLELocalDevice::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    uint32_t advertising_data_offset;
    tBleStatus status;
    
    if (minimumConnectionInterval > maximumConnectionInterval) {
        return false;
    }
    
    if ((minimumConnectionInterval < 0x0006) || (minimumConnectionInterval > 0x0c80)) {
        return false;
    }

    if ((maximumConnectionInterval < 0x0006) || (maximumConnectionInterval > 0x0c80)) {
        return false;
    }

    if (slaveLatency > 0x01f3) {
        return false;
    }
    
    if ((supervisionTimeout < 0x000a) || (supervisionTimeout > 0x0c80)) {
        return false;
    }

    m_ppcp.connection_interval_min = minimumConnectionInterval;
    m_ppcp.connection_interval_max = maximumConnectionInterval;
    m_ppcp.slave_latency = slaveLatency;
    m_ppcp.supervision_timeout = supervisionTimeout;

    if (!m_reset) {
        status = aci_gatt_update_char_value(m_gap_service_handle,
                                            m_ppcp_handle,
                                            0,
                                            8,
                                            reinterpret_cast<const uint8_t*>(&m_ppcp));

        if (status == BLE_STATUS_SUCCESS) {
            if (m_advertising.connection_interval_length) {
                advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length;

                m_advertising.data[advertising_data_offset+2] = (uint8_t)(m_ppcp.connection_interval_min >> 0);
                m_advertising.data[advertising_data_offset+3] = (uint8_t)(m_ppcp.connection_interval_min >> 8);
                m_advertising.data[advertising_data_offset+4] = (uint8_t)(m_ppcp.connection_interval_max >> 0);
                m_advertising.data[advertising_data_offset+5] = (uint8_t)(m_ppcp.connection_interval_max >> 8);
                
                if (m_peripheral.advertising) {
                    status = hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data);
                }
            }
        }
        
        if (status != BLE_STATUS_SUCCESS) {
            return false;
        }
    }

    return true;
}

unsigned int BLELocalDevice::serviceCount() {
    return m_server.count;
}

BLEService BLELocalDevice::service(unsigned int index) {
    BLEServerService *serverService;
    unsigned int n;
    
    if (index >= m_server.count)
    {
        return BLEService();
    }

    for (serverService = m_server.children, n = 0; n < index; n++) {
        serverService = serverService->m_server.sibling;
    }

    return serverService->service();
}

bool BLELocalDevice::addService(BLEService &service) {
    BLEServerService *serverService, *currentService, **previousService;
    BLEServerCharacteristic *characteristic;
    BLEServerDescriptor *descriptor;
    BLESecurity security, security_read, security_write, security_subscribe;

    if (m_process.published && (m_options & BLE_OPTION_NO_SERVICE_CHANGED)) {
        return false;
    }
    
    serverService = BLEServiceInstance::instance(service)->server();

    if (!serverService) {
        return false;
    }
    
    if (serverService->m_server.attrib[0]) {
        return false;
    }

