GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    serverService->reference();

    serverService->m_server.attrib[0] = 0xffff;
    serverService->m_server.attrib[1] = 0x0000;

    for (previousService = &m_server.children, currentService = *previousService;
         currentService;
         previousService = &currentService->m_server.sibling, currentService = *previousService)
    {
    }

    *previousService = serverService;

    for (security = BLE_SECURITY_UNENCRYPTED, serverService = m_server.children; serverService; serverService = serverService->m_server.sibling) {
        for (characteristic = serverService->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
            security_read = (BLESecurity)((characteristic->m_permissions >> 0) & 3);
            security_write = (BLESecurity)((characteristic->m_permissions >> 2) & 3);
            security_subscribe = (BLESecurity)((characteristic->m_permissions >> 4) & 3);
            
            if (characteristic->m_properties & (BLE_PROPERTY_READ)) {
                if (security < security_read) {
                    security = security_read;
                }
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_WRITE)) {
                if (security < security_write) {
                    security = security_write;
                }
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                if (security < security_subscribe) {
                    security = security_subscribe;
                }
            }
            
            for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
                security_read = (BLESecurity)((descriptor->m_permissions >> 0) & 3);

                if (security < security_read) {
                    security = security_read;
                }
            }
        }
        
    }

    m_server.security = security;
    m_server.count++;
    
    if (m_process.published) {
        if (!insert(serverService)) {
            removeService(service);
            return false;
        }
    }

    return true;
}

bool BLELocalDevice::removeService(BLEService &service) {
    class BLEServerService *serverService, *currentService, **previousService;
    BLEServerCharacteristic *characteristic;
    BLEServerDescriptor *descriptor;
    BLESecurity security, security_read, security_write, security_subscribe;

    if (m_process.published && (m_options & BLE_OPTION_NO_SERVICE_CHANGED)) {
        return false;
    }

    serverService = BLEServiceInstance::instance(service)->server();

    if (!serverService) {
        return false;
    }

    for (previousService = &m_server.children, currentService = *previousService;
         currentService;
         previousService = &currentService->m_server.sibling, currentService = *previousService)
    {
        if (currentService == serverService) {
            *previousService = serverService->m_server.sibling;
            break;
        }
    }

    if (!currentService) {
        return false;
    }
    
    if (m_process.published) {
        if (serverService->m_server.handle) {
            remove(serverService);
        }
    }
    
    for (security = BLE_SECURITY_UNENCRYPTED, currentService = m_server.children; currentService; currentService = currentService->m_server.sibling) {
        for (characteristic = currentService->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
            security_read = (BLESecurity)((characteristic->m_permissions >> 0) & 3);
            security_write = (BLESecurity)((characteristic->m_permissions >> 2) & 3);
            security_subscribe = (BLESecurity)((characteristic->m_permissions >> 4) & 3);
            
            if (characteristic->m_properties & (BLE_PROPERTY_READ)) {
                if (security < security_read) {
                    security = security_read;
                }
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_WRITE)) {
                if (security < security_write) {
                    security = security_write;
                }
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                if (security < security_subscribe) {
                    security = security_subscribe;
                }
            }
            
            for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
                security_read = (BLESecurity)((descriptor->m_permissions >> 0) & 3);

                if (security < security_read) {
                    security = security_read;
                }
            }
        }
    }

    m_server.security = security;
    m_server.count--;

    serverService->m_server.attrib[0] = 0x0000;
    serverService->m_server.attrib[1] = 0x0000;
        
    serverService->unreference();

    return true;
}

bool BLELocalDevice::setSecurity(BLESecurity security) {
    m_peripheral.security = security;

    return true;
}

bool BLELocalDevice::setBonding(bool bonding) {
    m_peripheral.bonding = bonding;

    return true;
}

bool BLELocalDevice::setPin(const char *pin) {
    uint32_t fixed_pin, index;

    if (!pin) {
        m_peripheral.fixed_pin = BLE_FIXED_PIN_UNDEFINED;
    } else {
        if (strlen(pin) != 6) {
            return false;
        }

        for (fixed_pin =0, index = 0; index < 6; index++) {
            if ((pin[index] < '0') || (pin[index] > '9')) {
                return false;
            }
            
            fixed_pin = (fixed_pin * 10) + (pin[index] - '0');
        }

        m_peripheral.fixed_pin = fixed_pin;
    }
    
    return true;
}

void BLELocalDevice::clearBondStorage(void) {
    aci_gap_clear_security_db();
}

bool BLELocalDevice::setIncludeTxPowerLevel(bool enable) {
    uint32_t advertising_data_offset, length;

    if (m_advertising.custom_length) {
        return false;
    }
    
    if (enable) {
        length = 3;
        
        if (((m_advertising.data_length - m_advertising.tx_power_level_length) + length) > (int)(MAX_ADV_DATA_LEN)) {
            return false;
        }
    }

    advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length + m_advertising.connection_interval_length;

    if (m_advertising.tx_power_level_length) {
        memmove(&m_advertising.data[advertising_data_offset],
                &m_advertising.data[advertising_data_offset + m_advertising.tx_power_level_length],
                ((m_advertising.data_length - advertising_data_offset) - m_advertising.tx_power_level_length));

        m_advertising.data_length -= m_advertising.tx_power_level_length;
        m_advertising.tx_power_level_length = 0;
    }

    if (enable) {
        memmove(&m_advertising.data[advertising_data_offset + length],
                &m_advertising.data[advertising_data_offset],
                (m_advertising.data_length - advertising_data_offset));
        
        m_advertising.data[advertising_data_offset++] = length -1;
        m_advertising.data[advertising_data_offset++] = BLE_AD_TYPE_TX_POWER_LEVEL;
        m_advertising.data[advertising_data_offset++] = m_tx_power_level;

