GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
        m_advertising.data_length += length;
        m_advertising.tx_power_level_length = length;
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return true;
}

bool BLELocalDevice::setIncludeConnectionInterval(bool enable) {
    uint32_t advertising_data_offset, length;

    if (m_advertising.custom_length) {
        return false;
    }

    if (enable) {
        length = 6;
        
        if (((m_advertising.data_length - m_advertising.connection_interval_length) + length) > (int)(MAX_ADV_DATA_LEN)) {
            return false;
        }
    } else {
        length = 0;
    }
            

    advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length;

    if (m_advertising.connection_interval_length) {
        memmove(&m_advertising.data[advertising_data_offset],
                &m_advertising.data[advertising_data_offset + m_advertising.connection_interval_length],
                ((m_advertising.data_length - advertising_data_offset) - m_advertising.connection_interval_length));

        m_advertising.data_length -= m_advertising.connection_interval_length;
        m_advertising.connection_interval_length = 0;
    }

    if (length) {
        memmove(&m_advertising.data[advertising_data_offset + length],
                &m_advertising.data[advertising_data_offset],
                (m_advertising.data_length - advertising_data_offset));
        
        m_advertising.data[advertising_data_offset++] = length -1;
        m_advertising.data[advertising_data_offset++] = BLE_AD_TYPE_SLAVE_CONN_INTERVAL;
        m_advertising.data[advertising_data_offset++] = (uint8_t)(m_ppcp.connection_interval_min >> 0);
        m_advertising.data[advertising_data_offset++] = (uint8_t)(m_ppcp.connection_interval_min >> 8);
        m_advertising.data[advertising_data_offset++] = (uint8_t)(m_ppcp.connection_interval_max >> 0);
        m_advertising.data[advertising_data_offset++] = (uint8_t)(m_ppcp.connection_interval_max >> 8);

        m_advertising.data_length += length;
        m_advertising.connection_interval_length = length;
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return true;
}

bool BLELocalDevice::setLocalName(const char *localName) {
    uint32_t advertising_data_offset, length;

    if (m_advertising.custom_length) {
        return false;
    }
    
    if (localName) {
        length = 2 + strlen(localName);

        if (((m_advertising.data_length - m_advertising.local_name_length) + length) > (int)(MAX_ADV_DATA_LEN)) {
            return false;
        }
    } else {
        length = 0;
    }

    advertising_data_offset = 3;

    if (m_advertising.local_name_length) {
        memmove(&m_advertising.data[advertising_data_offset],
                &m_advertising.data[advertising_data_offset + m_advertising.local_name_length],
                ((m_advertising.data_length - advertising_data_offset) - m_advertising.local_name_length));

        m_advertising.data_length -= m_advertising.local_name_length;
        m_advertising.local_name_length = 0;
    }

    if (length) {
        memmove(&m_advertising.data[advertising_data_offset + length],
                &m_advertising.data[advertising_data_offset],
                (m_advertising.data_length - advertising_data_offset));
        
        m_advertising.data[advertising_data_offset++] = length -1;
        m_advertising.data[advertising_data_offset++] = BLE_AD_TYPE_COMPLETE_LOCAL_NAME;
        memcpy(&m_advertising.data[advertising_data_offset], localName, length -2);

        m_advertising.data_length += length;
        m_advertising.local_name_length = length;
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }

    return false;
}

bool BLELocalDevice::setAdvertisedServiceUuids(const char *uuids[], int count, bool complete) {
    uint32_t uuid16_data_offset, uuid128_data_offset, advertising_data_offset, length;
    uint8_t uuid16_data[MAX_ADV_DATA_LEN], uuid128_data[MAX_ADV_DATA_LEN];
    BLEUuid service_uuid;
    int index;
    
    if (m_advertising.custom_length) {
        return false;
    }

    uuid16_data_offset = 0;
    uuid128_data_offset = 0;
    
    for (index = 0; index < count; index++) {
        service_uuid = BLEUuid(uuids[index]);
            
        if (service_uuid.type() == BLEUuidType::UNDEFINED) {
            return false;
        }
            
        if (service_uuid.type() == BLEUuidType::UUID16) {
            if (uuid16_data_offset > (MAX_ADV_DATA_LEN - 2)) {
                return false;
            }
                
            memcpy(&uuid16_data[uuid16_data_offset], service_uuid.data(), 2);
            uuid16_data_offset += 2;
        } else {
            if (uuid128_data_offset > (MAX_ADV_DATA_LEN - 16)) {
                return false;
            }
                
            memcpy(&uuid128_data[uuid128_data_offset], service_uuid.data(), 16);
            uuid128_data_offset += 16;
        }
    }
        
    length = 0;
    
    if (uuid16_data_offset) {
        length += (2 + uuid16_data_offset);
    }
    
    if (uuid128_data_offset) {
        length += (2 + uuid128_data_offset);
    }

    if (length) {
        if (((m_advertising.data_length - m_advertising.service_uuids_length) + length) > (int)(MAX_ADV_DATA_LEN)) {
            return false;
        }
    }
    
    advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length + m_advertising.connection_interval_length + m_advertising.tx_power_level_length;
    
    if (m_advertising.service_uuids_length) {
        memmove(&m_advertising.data[advertising_data_offset],
                &m_advertising.data[advertising_data_offset + m_advertising.service_uuids_length],
                ((m_advertising.data_length - advertising_data_offset) - m_advertising.service_uuids_length));

        m_advertising.data_length -= m_advertising.service_uuids_length;
        m_advertising.service_uuids_length = 0;
    }

