GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    if (length) {
        memmove(&m_advertising.data[advertising_data_offset + length],
                &m_advertising.data[advertising_data_offset],
                (m_advertising.data_length - advertising_data_offset));

        if (uuid16_data_offset) {
            m_advertising.data[advertising_data_offset++] = 1 + uuid16_data_offset;
            m_advertising.data[advertising_data_offset++] = complete ? BLE_AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST : BLE_AD_TYPE_16_BIT_SERV_UUID;
            
            memcpy(&m_advertising.data[advertising_data_offset], &uuid16_data[0], uuid16_data_offset);
            advertising_data_offset += uuid16_data_offset;
        }

        if (uuid128_data_offset) {
            m_advertising.data[advertising_data_offset++] = 1 + uuid128_data_offset;
            m_advertising.data[advertising_data_offset++] = complete ? BLE_AD_TYPE_128_BIT_SERV_UUID_CMPLT_LIST : BLE_AD_TYPE_128_BIT_SERV_UUID;

            memcpy(&m_advertising.data[advertising_data_offset], &uuid128_data[0], uuid128_data_offset);
            advertising_data_offset += uuid128_data_offset;
        }
        
        m_advertising.data_length += length;
        m_advertising.service_uuids_length = length;
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return false;
}

bool BLELocalDevice::setManufacturerData(const uint8_t data[], int length) {
    uint32_t advertising_data_offset;

    if (m_advertising.custom_length) {
        return false;
    }

    if (length) {
        length += 2;

        if (((m_advertising.data_length - m_advertising.manufacturer_data_length) + length) > (int)(MAX_ADV_DATA_LEN)) {
            return false;
        }
    } else {
        length = 0;
    }

    advertising_data_offset = 3 + m_advertising.local_name_length + m_advertising.service_uuids_length + m_advertising.connection_interval_length + m_advertising.tx_power_level_length;
    
    if (m_advertising.manufacturer_data_length) {
        memmove(&m_advertising.data[advertising_data_offset],
                &m_advertising.data[advertising_data_offset + m_advertising.manufacturer_data_length],
                ((m_advertising.data_length - advertising_data_offset) - m_advertising.manufacturer_data_length));

        m_advertising.data_length -= m_advertising.manufacturer_data_length;
        m_advertising.manufacturer_data_length = 0;
    }

    if (length) {
        memmove(&m_advertising.data[advertising_data_offset + length],
                &m_advertising.data[advertising_data_offset],
                (m_advertising.data_length - advertising_data_offset));
        
        m_advertising.data[advertising_data_offset++] = length -1;
        m_advertising.data[advertising_data_offset++] = BLE_AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
        memcpy(&m_advertising.data[advertising_data_offset], data, length -2);

        m_advertising.data_length += length;
        m_advertising.manufacturer_data_length = length;
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return true;
}

bool BLELocalDevice::setBeacon(const char *uuid, uint16_t major, uint16_t minor, int8_t rssi) {
    uint32_t length, index;
    uint8_t data[25];

    if (uuid) {
        length = 25;
        
        BLEUuid beacon_uuid = BLEUuid(uuid);

        if (beacon_uuid.type() != BLEUuidType::UUID128) {
            return false;
        }

        data[0] = 0x4c;
        data[1] = 0x00;
        data[2] = 0x02;
        data[3] = 0x15;

        for (index = 0; index < 16; index++) {
            data[4+index] = *(beacon_uuid.data() + (15 - index));
        }

        data[20] = (uint8_t)(major >> 8);
        data[21] = (uint8_t)(major >> 0);
        data[22] = (uint8_t)(minor >> 8);
        data[23] = (uint8_t)(minor >> 0);
        data[24] = (uint8_t)rssi;
    } else {
        length = 0;
    }

    return setManufacturerData(data, length);
}

bool BLELocalDevice::setAdvertisingData(const uint8_t data[], int length) {
    if (length > 28) {
        return false;
    }

    m_advertising.data_length = (3 + length);
    m_advertising.local_name_length = 0;
    m_advertising.service_uuids_length = 0;
    m_advertising.connection_interval_length = 0;
    m_advertising.tx_power_level_length = 0;
    m_advertising.manufacturer_data_length = 0;
    m_advertising.custom_length = length;

    if (length) {
        memcpy(&m_advertising.data[3], data, length);
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }

    return true;
}

bool BLELocalDevice::setScanResponseData(const uint8_t data[], int length) {
    if (length > 31) {
        return false;
    }

    m_advertising.scan_response_data_length = length;

    if (length) {
        memcpy(&m_advertising.scan_response_data[0], data, length);
    }

    if (m_peripheral.advertising) {
        if (hci_le_set_scan_response_data(m_advertising.scan_response_data_length, m_advertising.scan_response_data) != BLE_STATUS_SUCCESS) {
            return false;
        }
    }
    
    return true;
}

bool BLELocalDevice::setAdvertisingInterval(uint16_t minimumAdvertisingInterval, uint16_t maximumAdvertisingInterval) {

    if (minimumAdvertisingInterval > maximumAdvertisingInterval) {
        return false;
    }

    if ((minimumAdvertisingInterval < 0x0020) || (minimumAdvertisingInterval > 0x4000)) {
        return false;
    }

    if ((maximumAdvertisingInterval < 0x0020) || (maximumAdvertisingInterval > 0x4000)) {
        return false;
    }

    m_peripheral.advertising_interval_min = minimumAdvertisingInterval;
    m_peripheral.advertising_interval_max = maximumAdvertisingInterval;

