GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    return true;
}

void BLELocalDevice::setConnectable(bool connectable) {
    m_peripheral.connectable = connectable;
}

void BLELocalDevice::setDiscoverable(BLEDiscoverable discoverable) {
    m_peripheral.discoverable = discoverable;
}

bool BLELocalDevice::advertise() {
    uint32_t index, fixed_pin;
    uint8_t bonded_device_count, resolving_device_count;
    uint8_t mitm, sc, min_key_size, max_key_size, use_fixed_pin;
    BLESecurity security;
    Bonded_Device_Entry_t bonded_devices[((BLE_EVT_MAX_PARAM_LEN - 3) - 2) / sizeof(Bonded_Device_Entry_t)];
    tBleStatus status = BLE_STATUS_SUCCESS;

    security = m_peripheral.security;
    
    if (m_peripheral.security < m_server.security) {
        security = m_server.security;
    }
    
    switch (security) {
    case BLE_SECURITY_UNENCRYPTED:
        mitm = MITM_PROTECTION_NOT_REQUIRED;
        sc = SC_IS_SUPPORTED;
        min_key_size = 7;
        max_key_size = 16;
        use_fixed_pin = USE_FIXED_PIN_FOR_PAIRING_FORBIDDEN;
        fixed_pin = 0;
        break;
        
    case BLE_SECURITY_UNAUTHENTICATED:
        mitm = MITM_PROTECTION_NOT_REQUIRED;
        sc = SC_IS_SUPPORTED;
        min_key_size = 7;
        max_key_size = 16;
        use_fixed_pin = USE_FIXED_PIN_FOR_PAIRING_FORBIDDEN;
        fixed_pin = 0;
        break;
        
    case BLE_SECURITY_AUTHENTICATED:
        if (m_peripheral.fixed_pin == BLE_FIXED_PIN_UNDEFINED) {
            return false;
        }
        
        mitm = MITM_PROTECTION_REQUIRED;
        sc = SC_IS_SUPPORTED;
        min_key_size = 7;
        max_key_size = 16;
        use_fixed_pin = USE_FIXED_PIN_FOR_PAIRING_ALLOWED;
        fixed_pin = m_peripheral.fixed_pin;
        break;

    case BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION:
        if (m_peripheral.fixed_pin == BLE_FIXED_PIN_UNDEFINED) {
            return false;
        }

        mitm = MITM_PROTECTION_REQUIRED;
        sc = SC_IS_MANDATORY;
        min_key_size = 16;
        max_key_size = 16;
        use_fixed_pin = USE_FIXED_PIN_FOR_PAIRING_ALLOWED;
        fixed_pin = m_peripheral.fixed_pin;
        break;

    default:
        return false;
    }

    if (m_central || (m_peripheral.testing != BLE_TEST_MODE_NONE)) {
        return false;
    }
    
    if (m_peripheral.advertising) {
        m_peripheral.advertising = false;
        
        aci_gap_set_non_discoverable();
    }

    publish();

    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gap_set_io_capability((use_fixed_pin == USE_FIXED_PIN_FOR_PAIRING_ALLOWED) ? IO_CAP_DISPLAY_ONLY : IO_CAP_NO_INPUT_NO_OUTPUT);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gap_set_authentication_requirement(m_peripheral.bonding,
                                                        mitm,
                                                        sc,
                                                        KEYPRESS_NOT_SUPPORTED,
                                                        min_key_size,
                                                        max_key_size,
                                                        use_fixed_pin,
                                                        fixed_pin,
                                                        (m_options & BLE_OPTION_RANDOM_STATIC_ADDRESS));
    }

    if (status == BLE_STATUS_SUCCESS) {
        if ((m_options & BLE_OPTION_PRIVACY) || m_peripheral.bonding) {
            status = aci_gap_configure_whitelist();
        }
    }

    if (status == BLE_STATUS_SUCCESS) {
        if (m_options & BLE_OPTION_PRIVACY) {
            status = aci_gap_get_bonded_devices(&bonded_device_count, &bonded_devices[0]);

            if (status == BLE_STATUS_SUCCESS) {
                for (resolving_device_count = 0, index = 0; index < bonded_device_count; index++) {
                    if (bonded_devices[index].Address_Type == 0x00) {
                        bonded_devices[resolving_device_count++] = bonded_devices[index];
                    }
                }
                
                status = aci_gap_add_devices_to_resolving_list(resolving_device_count, (Whitelist_Identity_Entry_t*)&bonded_devices[0], true);
            }
        }
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        if (m_peripheral.discoverable == BLE_DISCOVERABLE_GENERAL) {
            status = aci_gap_set_discoverable(((m_peripheral.connectable) ? GAP_ADV_IND : (m_advertising.scan_response_data_length ? GAP_ADV_SCAN_IND : GAP_ADV_NONCONN_IND)),
                                              m_peripheral.advertising_interval_min,
                                              m_peripheral.advertising_interval_max,
                                              (m_options & (BLE_OPTION_RANDOM_STATIC_ADDRESS | BLE_OPTION_PRIVACY)),
                                              NO_WHITE_LIST_USE,
                                              0, NULL,
                                              0, NULL,
                                              0, 0);
        } else {
            status = aci_gap_set_limited_discoverable(((m_peripheral.connectable) ? GAP_ADV_IND : (m_advertising.scan_response_data_length ? GAP_ADV_SCAN_IND : GAP_ADV_NONCONN_IND)),
                                                      m_peripheral.advertising_interval_min,
                                                      m_peripheral.advertising_interval_max,
                                                      (m_options & (BLE_OPTION_RANDOM_STATIC_ADDRESS | BLE_OPTION_PRIVACY)),
                                                      NO_WHITE_LIST_USE,
                                                      0, NULL,
                                                      0, NULL,
                                                      0, 0);
        }
    }

    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gap_delete_ad_type(BLE_AD_TYPE_FLAGS);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = aci_gap_delete_ad_type(BLE_AD_TYPE_TX_POWER_LEVEL);
    }

    m_advertising.data[0] = 0x02;
    m_advertising.data[1] = BLE_AD_TYPE_FLAGS;
    m_advertising.data[2] = FLAG_BIT_BR_EDR_NOT_SUPPORTED | ((m_peripheral.discoverable == BLE_DISCOVERABLE_GENERAL) ? FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE : FLAG_BIT_LE_LIMITED_DISCOVERABLE_MODE);
    
    if (status == BLE_STATUS_SUCCESS) {
        status = hci_le_set_advertising_data(m_advertising.data_length, m_advertising.data);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        status = hci_le_set_scan_response_data(m_advertising.scan_response_data_length, m_advertising.scan_response_data);
    }
    
    if (status == BLE_STATUS_SUCCESS) {
        m_peripheral.advertising = true;
    }

    return m_peripheral.advertising;
}

void BLELocalDevice::stopAdvertise() {
    if (m_peripheral.advertising) {
        m_peripheral.advertising = false;
        
        aci_gap_set_non_discoverable();
    }
}

