GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
bool BLELocalDevice::advertising() {
    return m_peripheral.advertising;
}

BLEDevice BLELocalDevice::central() {
    if (m_central) {
        return m_central->device();
    }

    return BLEDevice();
}

bool BLELocalDevice::connected() {
    return (m_central != nullptr);
}

void BLELocalDevice::disconnect() {
    if (m_central) {
        aci_gap_terminate(m_central->m_handle, HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
    }
}

void BLELocalDevice::onStop(Callback callback) {
    m_stop_callback = callback;
}

void BLELocalDevice::onConnect(Callback callback) {
    m_connect_callback = callback;
}

void BLELocalDevice::onDisconnect(Callback callback) {
    m_disconnect_callback = callback;
}

bool BLELocalDevice::testTransmit(int channel, int length, BLEPayload payload, BLEPhy phy) {
    uint8_t status;

    if (m_central || (m_peripheral.testing != BLE_TEST_MODE_NONE) || m_peripheral.advertising) {
        return false;
    }

    if ((channel < 0) || (channel > 39)) {
        return false;
    }

    if ((length < 0) || (length > 255)) {
        return false;
    }

    status = hci_le_transmitter_test_v2(channel, length, payload, phy);

    if (status != BLE_STATUS_SUCCESS) {
        return false;
    }

    m_peripheral.testing = BLE_TEST_MODE_TRANSMIT;
    
    return true;
}

bool BLELocalDevice::testReceive(int channel, BLEPhy phy, int modulation) {
    uint8_t status;

    if (m_central || (m_peripheral.testing != BLE_TEST_MODE_NONE) || m_peripheral.advertising) {
        return false;
    }

    if ((channel < 0) || (channel > 39)) {
        return false;
    }

    if ((modulation < 0) || (modulation > 1)) {
        return false;
    }

    status = hci_le_receiver_test_v2(channel, phy, modulation);

    if (status != BLE_STATUS_SUCCESS) {
        return false;
    }

    m_peripheral.testing = BLE_TEST_MODE_RECEIVE;

    return true;
}    

uint32_t BLELocalDevice::testStop() {
    uint8_t status;
    uint32_t packets;
    
    if (m_peripheral.testing == BLE_TEST_MODE_NONE) {
        return false;
    }
    
    packets = 0;
    
    status = hci_le_test_end((uint16_t*)&packets);

    if (m_peripheral.testing == BLE_TEST_MODE_TRANSMIT) {
        if (status == BLE_STATUS_SUCCESS) {
            status = aci_hal_le_tx_test_packet_number((uint32_t*)&packets);
        }
    }

    if (status != BLE_STATUS_SUCCESS) {
        packets = 0;
    }
    
    m_peripheral.testing = BLE_TEST_MODE_NONE;

    return packets;
}

bool BLELocalDevice::testing() {
    return (m_peripheral.testing != BLE_TEST_MODE_NONE);
}

void BLELocalDevice::reset() {
    BLEServerService *service;
    BLEServerCharacteristic *characteristic, *request, *request_next;
    BLEServerDescriptor *descriptor;
    uint32_t index;
    Callback callback;
    
    for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
        if (m_process.service_table[index] != nullptr) {
            service = m_process.service_table[index];

            if (service->m_server.handle) {
                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                    for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
                        if (descriptor->m_server.handle) {
                            descriptor->m_server.handle = 0x0000;

                            descriptor->unreference();
                        }
                    }

                    characteristic->m_subscribed = 0;
                    characteristic->m_update_value = false;
                    characteristic->m_sync_value = false;
                    characteristic->m_sync_subscribed = false;
                    
                    if (characteristic->m_server.handle) {
                        characteristic->m_server.handle = 0x0000;

                        characteristic->m_written = 0x0000;
            
                        characteristic->unreference();
                    }
                }
        
                service->m_server.handle = 0x0000;
                service->m_server.attrib[0] = 0xffff;
                service->m_server.attrib[1] = 0x0000;
        
                service->unreference();
            }
        }
    }

    if (m_process.request_current) {
        request = m_process.request_current;

        callback = request->m_done_callback;

        request->m_process.request = nullptr;
        request->m_status = BLE_STATUS_FAILURE; // HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE

        callback();
    }

    for (request = m_process.request_head; request; request = request_next) {
        request_next = request->m_process.request;

        callback = request->m_done_callback;
        
        request->m_process.request = nullptr;
        request->m_status = BLE_STATUS_FAILURE; // HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE

        callback();
    }

    for (request = m_process.request_submit; request; request = request_next) {
        request_next = request->m_process.request;

        callback = request->m_done_callback;

        request->m_process.request = nullptr;
        request->m_status = BLE_STATUS_FAILURE; // HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE

        callback();
    }


    m_process.sequence = 0;

    m_process.connection = BLE_PEER_DEVICE_NOT_CONNECTED;
    m_process.published = false;
    m_process.service_count = 0;

    for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
        m_process.service_table[index] = nullptr;
    }
    
    m_process.request_head = nullptr;
    m_process.request_tail = nullptr;
    m_process.request_current = nullptr;
    m_process.request_submit = nullptr;

    m_process.sync_value = false;
    m_process.value_current = nullptr;

    m_process.sync_subscribed = false;
    m_process.subscribed_current = nullptr;
}

bool BLELocalDevice::publish() {
    BLEServerService *service;
    
    if (m_process.published) {
        return true;
    }

    for (service = m_server.children; service; service = service->m_server.sibling) {
        if (!insert(service)) {
            for (service = m_server.children; service; service = service->m_server.sibling) {
                if (service->m_server.handle) {
                    remove(service);
                }
            }

