GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
            return false;
        }
    }

    m_process.published = true;
    
    return true;
}

bool BLELocalDevice::insert(BLEServerService *service) {
    BLEServerCharacteristic *characteristic;
    BLEServerDescriptor *descriptor;
    BLESecurity security_read, security_write, security_subscribe;
    unsigned int index, attribute_count;
    uint16_t service_changed[2];
    uint8_t value_permissions, cccd_permissions, notify;
    tBleStatus status;
    
    if (m_process.service_count == BLE_NUM_GATT_SERVICES) {
        return false;
    }

    m_process.service_count++;
    
    for (attribute_count = 1, characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
        attribute_count += 2;
    
        if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
            attribute_count += 1;
        }

        for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
            attribute_count += 2;
        }
    }

    BLEUuid service_uuid(service->m_uuid);
        
    status = aci_gatt_add_service(((service_uuid.type() == BLEUuidType::UUID16) ? UUID_TYPE_16 : UUID_TYPE_128),
                                  reinterpret_cast<const Service_UUID_t*>(service_uuid.data()),
                                  0x01,
                                  attribute_count,
                                  &service->m_server.handle);

    if (status == BLE_STATUS_SUCCESS) {
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("ADD-SERVICE \"%s\", %04x\r\n", service->m_uuid, service->m_server.handle);
#endif
      
        service->reference();

        service->m_server.attrib[0] = service->m_server.handle +1;
        service->m_server.attrib[1] = service->m_server.handle +1 + (attribute_count -1);
        
        for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
            BLEUuid characteristic_uuid(characteristic->m_uuid);
            
            value_permissions = 0;
            cccd_permissions = 0;
            
            notify = GATT_DONT_NOTIFY_EVENTS;
            
            security_read = (BLESecurity)((characteristic->m_permissions >> 0) & 3);
            security_write = (BLESecurity)((characteristic->m_permissions >> 2) & 3);
            security_subscribe = (BLESecurity)((characteristic->m_permissions >> 4) & 3);
            
            if (characteristic->m_properties & (BLE_PROPERTY_READ)) {
                notify |= GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP;

                switch (security_read) {
                case BLE_SECURITY_UNENCRYPTED:
                    break;
                case BLE_SECURITY_UNAUTHENTICATED:
                    value_permissions |= ATTR_PERMISSION_ENCRY_READ;
                    break;
                case BLE_SECURITY_AUTHENTICATED:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ);
                    break;
                case BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ);
                    break;
                };
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_WRITE)) {
                notify |= GATT_NOTIFY_ATTRIBUTE_WRITE;

                switch (security_write) {
                case BLE_SECURITY_UNENCRYPTED:
                break;
                case BLE_SECURITY_UNAUTHENTICATED:
                    value_permissions |= ATTR_PERMISSION_ENCRY_WRITE;
                    break;
                case BLE_SECURITY_AUTHENTICATED:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_WRITE | ATTR_PERMISSION_AUTHEN_WRITE);
                    break;
                case BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_WRITE | ATTR_PERMISSION_AUTHEN_WRITE);
                    break;
                };
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                notify |= GATT_NOTIFY_ATTRIBUTE_WRITE;

                switch (security_subscribe) {
                case BLE_SECURITY_UNENCRYPTED:
                    break;
                case BLE_SECURITY_UNAUTHENTICATED:
                    cccd_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_ENCRY_WRITE);
                    break;
                case BLE_SECURITY_AUTHENTICATED:
                    cccd_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ | ATTR_PERMISSION_ENCRY_WRITE | ATTR_PERMISSION_AUTHEN_WRITE);
                    break;
                case BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION:
                    cccd_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ | ATTR_PERMISSION_ENCRY_WRITE | ATTR_PERMISSION_AUTHEN_WRITE);
                    break;
                };
            }

            if (status == BLE_STATUS_SUCCESS) {
                status = aci_gatt_add_char(service->m_server.handle,
                                           ((characteristic_uuid.type() == BLEUuidType::UUID16) ? UUID_TYPE_16 : UUID_TYPE_128),
                                           reinterpret_cast<const Char_UUID_t*>(characteristic_uuid.data()),
                                           characteristic->m_value_size,
                                           characteristic->m_properties,
                                           value_permissions,
                                           notify,
                                           7,
                                           !characteristic->m_fixed_length,
                                           &characteristic->m_server.handle);
            }
            
            if (status == BLE_STATUS_SUCCESS) {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("ADD-CHARACTERISTIC \"%s\", %04x\r\n", characteristic->m_uuid, characteristic->m_server.handle);
#endif
                characteristic->reference();

                if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                    status = aci_gatt_set_security_permission(service->m_server.handle,
                                                              (characteristic->m_server.handle + BLE_CCCD_ATTRIB_HANDLE_OFFSET),
                                                              cccd_permissions);
                }
            }

            for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
                BLEUuid descriptor_uuid(descriptor->m_uuid);

                value_permissions = 0;

                security_read = (BLESecurity)((descriptor->m_permissions >> 0) & 3);

                switch (security_read) {
                case BLE_SECURITY_UNENCRYPTED:
                    break;
                case BLE_SECURITY_UNAUTHENTICATED:
                    value_permissions |= ATTR_PERMISSION_ENCRY_READ;
                    break;
                case BLE_SECURITY_AUTHENTICATED:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ);
                    break;
                case BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION:
                    value_permissions |= (ATTR_PERMISSION_ENCRY_READ | ATTR_PERMISSION_AUTHEN_READ);
                    break;
                };
                
                status = aci_gatt_add_char_desc(service->m_server.handle,
                                                characteristic->m_server.handle,
                                                ((descriptor_uuid.type() == BLEUuidType::UUID16) ? UUID_TYPE_16 : UUID_TYPE_128),
                                                reinterpret_cast<const Char_Desc_Uuid_t*>(descriptor_uuid.data()),
                                                descriptor->m_value_length,
                                                descriptor->m_value_length,
                                                descriptor->m_value,
                                                value_permissions,
                                                ATTR_ACCESS_READ_ONLY,
                                                GATT_DONT_NOTIFY_EVENTS,
                                                7,
                                                false,
                                                &descriptor->m_server.handle);
                
                if (status != BLE_STATUS_SUCCESS) {
                    descriptor->reference();
                }
            }
        }
    }
    
    if (status != BLE_STATUS_SUCCESS) {
        remove(service);
        
