GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
        return false;
    }

    if (m_central) {
        for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
            if (characteristic->m_properties & BLE_PROPERTY_READ) {
                characteristic->m_update_value = true;
            }
            
            if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                characteristic->m_sync_subscribed = true;
                m_process.sync_subscribed = true;
            }
        }
    }
    
    for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
        if (m_process.service_table[index] == nullptr) {
            m_process.service_table[index] = service;
            break;
        }
    }

    if (m_central) {
        if (!(m_options & BLE_OPTION_NO_SERVICE_CHANGED)) {
            service_changed[0] = service->m_server.handle;
            service_changed[1] = service->m_server.attrib[1];
            
            aci_gatt_update_char_value(BLE_ATT_SERVICE_HANDLE,
                                       BLE_SERVICE_CHANGED_HANDLE,
                                       0,
                                       4,
                                       (const uint8_t*)&service_changed[0]);
        }
        
        if (m_process.sync_value || m_process.sync_subscribed) {
            k_work_submit(&m_process.work);
        }
    }
    
    return true;
}

void BLELocalDevice::remove(BLEServerService *service) {
    BLEServerCharacteristic *characteristic;
    BLEServerDescriptor *descriptor;
    uint16_t service_changed[2];
    int index;

    for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
        if (m_process.service_table[index] == service) {
            m_process.service_table[index] = nullptr;
            break;
        }
    }

    m_process.service_count--;

    if (service->m_server.handle) {
        service_changed[0] = service->m_server.handle;
        service_changed[1] = service->m_server.attrib[1];

        for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
            for (descriptor = characteristic->m_server.children; descriptor; descriptor = descriptor->m_server.sibling) {
                if (descriptor->m_server.handle) {
                    descriptor->m_server.handle = 0x0000;

                    descriptor->unreference();
                }
            }

            characteristic->m_subscribed = 0;
            characteristic->m_update_type = 0;
            characteristic->m_update_value = false;
            characteristic->m_sync_value = false;
            characteristic->m_sync_subscribed = false;
            
            if (characteristic->m_server.handle) {
                aci_gatt_del_char(service->m_server.handle, characteristic->m_server.handle);
            
                characteristic->m_server.handle = 0x0000;
            
                characteristic->unreference();
            }
        }
        
        aci_gatt_del_service(service->m_server.handle);

        service->m_server.handle = 0x0000;
        service->m_server.attrib[0] = 0xffff;
        service->m_server.attrib[1] = 0x0000;
        
        service->unreference();
        
        if (m_central) {
            if (!(m_options & BLE_OPTION_NO_SERVICE_CHANGED)) {
                aci_gatt_update_char_value(BLE_ATT_SERVICE_HANDLE,
                                           BLE_SERVICE_CHANGED_HANDLE,
                                           0,
                                           4,
                                           (const uint8_t*)&service_changed[0]);
            }
        }
    }
}

void BLELocalDevice::request(class BLEServerCharacteristic *request) {
    class BLEServerCharacteristic *request_submit;

    do {
        request_submit = m_process.request_submit;

        request->m_process.request = request_submit;
    } while ((BLEServerCharacteristic *)armv7m_atomic_cas((volatile uint32_t*)&m_process.request_submit, (uint32_t)request_submit, (uint32_t)request) != request_submit);

    if (!request_submit) {
        k_work_submit(&m_process.work);
    }
}

BLEPeerDevice *BLELocalDevice::complete(uint16_t handle, const uint8_t *address, uint8_t type, uint16_t connectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    BLEPeerDevice *central;
    BLEServerService *service;
    BLEServerCharacteristic *characteristic;
    uint32_t index;

    m_process.connection = handle;
                            
    central = new BLEPeerDevice(handle, address, type, connectionInterval, slaveLatency, supervisionTimeout);
    
    if (central) {
        if (m_peripheral.security != BLE_SECURITY_UNENCRYPTED) {
            armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_SLAVE_SECURITY);
        }

        if ((m_tx_phy != BLE_PHY_1M) || (m_rx_phy != BLE_PHY_1M)) {
            armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_HCI_LE_SET_PHY);
        }
        
        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
            service = m_process.service_table[index];

            if (service) {
                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                    if (characteristic->m_properties & BLE_PROPERTY_READ) {
                        characteristic->m_update_value = true;
                    }

                    if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                        characteristic->m_sync_subscribed = true;
                        m_process.sync_subscribed = true;
                    }
                }
            }
        }
        
        m_peripheral.advertising = false;
        
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("PROCESS-CONNECT\r\n");
#endif
        
        m_connect_callback();

        for (index = 0; index < m_process.service_count; index++) {
            m_process.service_table[index]->m_connect_callback();
        }
    } else {
        armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
        
        if (m_peripheral.advertising) {
            m_peripheral.advertising = false;
            
#if (BLE_TRACE_SUPPORTED == 1)
            armv7m_rtt_printf("PROCESS-STOP\r\n");
#endif
            
