GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
            m_stop_callback();
        }
    }

    return central;
}

void BLELocalDevice::terminate() {
    BLEServerService *service;
    BLEServerCharacteristic *characteristic;
    uint32_t index;
    Callback callback;
    
    if (m_central) {
        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
            service = m_process.service_table[index];

            if (service) {
                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                    if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                        if (characteristic->m_subscribed) {
                            characteristic->m_subscribed = 0;

#if (BLE_TRACE_SUPPORTED == 1)
                            armv7m_rtt_printf("PROCESS-SUBSCRIBED %02x (\"%s\")\r\n", 0, characteristic->m_uuid);
#endif
                            
                            characteristic->m_subscribed_callback();
                        }
                    }
                    
                    characteristic->m_update_value = false;
                    characteristic->m_sync_value = false;
                    characteristic->m_sync_subscribed = false;
                }
            }
        }
        
        if (m_process.sequence & BLE_EVENT_GATT_SERVER_CONFIRMATION) {
            armv7m_atomic_and(&m_process.sequence, ~BLE_EVENT_GATT_SERVER_CONFIRMATION);
            
            characteristic = m_process.request_current;

            m_process.request_current = nullptr;
            
#if (BLE_TRACE_SUPPORTED == 1)
            armv7m_rtt_printf("PROCESS-DONE %02x (\"%s\", %02x)\r\n", HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE, characteristic->m_uuid, characteristic->m_update_type);
#endif

            callback = characteristic->m_done_callback;
            
            characteristic->m_status = BLE_STATUS_FAILURE; // HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE;
            
            callback();
        }
        
        m_central->m_handle = BLE_PEER_DEVICE_NOT_CONNECTED;
        
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("PROCESS-DISCONNECT\r\n");
#endif

        for (index = 0; index < m_process.service_count; index++) {
            m_process.service_table[index]->m_disconnect_callback();
        }
        
        m_disconnect_callback();
        
        m_central->unreference();
        m_central = nullptr;
    }
    
    armv7m_atomic_and(&m_process.sequence, BLE_BUSY_MASK);

    m_process.sync_value = false;
    m_process.value_current = NULL;

    m_process.sync_subscribed = false;
    m_process.subscribed_current = NULL;
}

void BLELocalDevice::connection(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    m_process.connection_interval_min = minimumConnectionInterval;
    m_process.connection_interval_max = maximumConnectionInterval;
    m_process.slave_latency = slaveLatency;
    m_process.supervision_timeout = supervisionTimeout;

    armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_L2CAP_CONNECTION_PARAMETER_UPDATE);

    k_work_submit(&m_process.work);
}

void BLELocalDevice::process() {
    BLEServerService *service;
    BLEServerCharacteristic *characteristic, *request_submit, *request_next, *request_head, *request_tail;
    uint32_t index, entry;
    const hci_uart_pckt *event;    
    const hci_event_pckt *hci_event;
    const evt_le_meta_event *hci_le_event;
    const evt_blue_aci *hci_vs_event;
    Callback callback;
    
    if (m_reset) {
        return;
    }

#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("PROCESS-ENTER %08x\r\n", (unsigned int)m_process.sequence);
#endif
    
    if ((m_process.sequence & BLE_BUSY_MASK) && (m_process.command.status != STM32WB_IPCC_BLE_COMMAND_STATUS_BUSY)) {
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("PROCESS-STATUS %02x\r\n", *((uint8_t*)m_process.command.rparam));
#endif
        if (m_process.sequence & BLE_BUSY_GATT_ALLOW_READ) {
        }

        if (m_process.sequence & BLE_BUSY_GATT_CONFIRM_INDICATION) {
        }

        if (m_process.sequence & BLE_BUSY_GAP_TERMINATE) {
        }

        else if (m_process.sequence & BLE_BUSY_GAP_SLAVE_SECURITY) {
            const aci_gap_slave_security_req_rp0 *rparam = (const aci_gap_slave_security_req_rp0*)m_process.command.rparam;

            if (rparam->Status == BLE_STATUS_SUCCESS) {
                armv7m_atomic_or(&m_process.sequence, BLE_EVENT_GAP_PAIRING_COMPLETE);
            } else {
                armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
            }
        }

        else if (m_process.sequence & BLE_BUSY_GAP_ALLOW_REBOND) {
            const aci_gap_slave_security_req_rp0 *rparam = (const aci_gap_slave_security_req_rp0*)m_process.command.rparam;

            if (rparam->Status != BLE_STATUS_SUCCESS) {
                armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
            }
        }
        
        else if (m_process.sequence & BLE_BUSY_L2CAP_CONNECTION_PARAMETER_UPDATE) {
        }

        else if (m_process.sequence & BLE_BUSY_HCI_LE_SET_PHY) {
        }

        else if (m_process.sequence & BLE_BUSY_GATT_UPDATE_CHAR_VALUE_EXT) {
            const aci_gatt_update_char_value_ext_rp0 *rparam = (const aci_gatt_update_char_value_ext_rp0*)m_process.command.rparam;

            if (m_process.request_current) {
                characteristic = m_process.request_current;
            
                if (rparam->Status != BLE_STATUS_INSUFFICIENT_RESOURCES) {
                    if (rparam->Status == BLE_STATUS_SUCCESS) {
                        m_process.request_offset += m_process.request_count;
                        
                        if (m_process.request_offset == m_process.request_length) {
                            if (characteristic->m_update_type & 0x02) {
                                if (m_central) {
                                    armv7m_atomic_or(&m_process.sequence, BLE_EVENT_GATT_SERVER_CONFIRMATION);
                                } else {
                                    m_process.request_current = nullptr;
                                    
#if (BLE_TRACE_SUPPORTED == 1)
                                    armv7m_rtt_printf("PROCESS-DONE %02x (\"%s\", %02x)\r\n", HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE, characteristic->m_uuid, characteristic->m_update_type);
#endif

                                    callback = characteristic->m_done_callback;
                                    
