GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
                                    characteristic->m_status = BLE_STATUS_FAILURE; // HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE

                                    callback();
                                }
                            } else {
                                m_process.request_current = nullptr;
                                
#if (BLE_TRACE_SUPPORTED == 1)
                                armv7m_rtt_printf("PROCESS-DONE %02x (\"%s\", %02x)\r\n", rparam->Status, characteristic->m_uuid, characteristic->m_update_type);
#endif

                                callback = characteristic->m_done_callback;
                                
                                characteristic->m_status = (rparam->Status == HCI_SUCCESS_ERR_CODE) ? (uint8_t)BLE_STATUS_SUCCESS : (uint8_t)BLE_STATUS_FAILURE;

                                callback();
                            }
                        }
                    } else {
                        m_process.request_current = nullptr;
                        
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-DONE %02x (\"%s\", %02x)\r\n", rparam->Status, characteristic->m_uuid, characteristic->m_update_type);
#endif
                        
                        callback = characteristic->m_done_callback;
                                
                        characteristic->m_status = (rparam->Status == HCI_SUCCESS_ERR_CODE) ? (uint8_t)BLE_STATUS_SUCCESS : (uint8_t)BLE_STATUS_FAILURE;
                        
                        callback();
                    }

                    if (characteristic->m_written) {
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-WRITTEN (\"%s\")\r\n", characteristic->m_uuid);
#endif
                        characteristic->m_written_callback();
                    }
                } else {
                    if (m_central) {
                        armv7m_atomic_or(&m_process.sequence, BLE_EVENT_GATT_TX_POOL_AVAILABLE);
                    }
                }
            }

            else if (m_process.value_current) {
                characteristic = m_process.value_current;

                if (rparam->Status == BLE_STATUS_SUCCESS) {
                    m_process.value_offset += m_process.value_count;
                    
                    if (m_process.value_offset == m_process.value_length) {
                        m_process.value_current = nullptr;

#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-UPDATE %02x (\"%s\")\r\n", rparam->Status, characteristic->m_uuid);
#endif
                    }
                } else {
                    m_process.value_current = nullptr;

#if (BLE_TRACE_SUPPORTED == 1)
                    armv7m_rtt_printf("PROCESS-UPDATE %02x (\"%s\")\r\n", rparam->Status, characteristic->m_uuid);
#endif

                }
            }
        } else if (m_process.sequence & BLE_BUSY_GATT_READ_HANDLE_VALUE) {
            const aci_gatt_read_handle_value_rp0 *rparam = (const aci_gatt_read_handle_value_rp0*)m_process.command.rparam;

            if (m_process.subscribed_current) {
                characteristic = m_process.subscribed_current;
            
                m_process.subscribed_current = nullptr;
                
                if (rparam->Status == BLE_STATUS_SUCCESS) {
                    if (characteristic->m_subscribed != (rparam->Value[0] & 3)) {
                        characteristic->m_subscribed = (rparam->Value[0] & 3);
                    
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-SUBSCRIBED %02x (\"%s\")\r\n", characteristic->m_subscribed, characteristic->m_uuid);
#endif
                        
                        characteristic->m_subscribed_callback();
                    }
                } else {
#if (BLE_TRACE_SUPPORTED == 1)
                    armv7m_rtt_printf("PROCESS-SUBSCRIBED %02x (\"%s\")\r\n", characteristic->m_subscribed, characteristic->m_uuid);
#endif
                }
            }
        }
        
        armv7m_atomic_and(&m_process.sequence, ~BLE_BUSY_MASK);
    }
    
    event = (const hci_uart_pckt*)stm32wb_ipcc_ble_event();

    if (event) {
        do {
            if (event->type == HCI_EVENT_PKT_TYPE) {
                hci_event = (const hci_event_pckt*)&event->data[0];

#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("HCI_EVENT %08x\r\n", hci_event->evt);
#endif

                switch (hci_event->evt) {

                case HCI_DISCONNECTION_COMPLETE_EVENT: {
                    const hci_disconnection_complete_event_rp0 *eparams = (const hci_disconnection_complete_event_rp0*)&hci_event->data[0];

                    if (m_process.connection == eparams->Connection_Handle) {
                        m_process.connection = BLE_PEER_DEVICE_NOT_CONNECTED;

                        terminate();
                    }
                    break;
                }
                    
                case HCI_ENCRYPTION_CHANGE_EVENT:
                case HCI_READ_REMOTE_VERSION_INFORMATION_COMPLETE_EVENT:
                case HCI_HARDWARE_ERROR_EVENT:
                case HCI_ENCRYPTION_KEY_REFRESH_COMPLETE_EVENT:
                    break;
                    
                case HCI_LE_META_EVENT:
                    hci_le_event = (const evt_le_meta_event*)&hci_event->data[0];

#if (BLE_TRACE_SUPPORTED == 1)
                    armv7m_rtt_printf("HCI_LE_EVENT %08x\r\n", hci_le_event->subevent);
#endif
                    
                    switch (hci_le_event->subevent) {
                        
                    case HCI_LE_CONNECTION_COMPLETE_EVENT: {
                        const hci_le_connection_complete_event_rp0 *eparam = (const hci_le_connection_complete_event_rp0*)&hci_le_event->data[0];

                        if (eparam->Status == BLE_STATUS_SUCCESS) {
                            m_central = complete(eparam->Connection_Handle,
                                                 eparam->Peer_Address,
                                                 eparam->Peer_Address_Type,
                                                 eparam->Conn_Interval,
                                                 eparam->Conn_Latency,
                                                 eparam->Supervision_Timeout);
                        } else {
                            if (m_peripheral.advertising) {
                                m_peripheral.advertising = false;

#if (BLE_TRACE_SUPPORTED == 1)
                                armv7m_rtt_printf("PROCESS-STOP\r\n");
#endif
                                
