GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
                                m_stop_callback();
                            }
                        }
                        break;
                    }
                        
                    case HCI_LE_ENHANCED_CONNECTION_COMPLETE_EVENT: {
                        const hci_le_enhanced_connection_complete_event_rp0 *eparam = (const hci_le_enhanced_connection_complete_event_rp0*)&hci_le_event->data[0];

                        if (eparam->Status == BLE_STATUS_SUCCESS) {
                            m_central = complete(eparam->Connection_Handle,
                                                 eparam->Peer_Address,
                                                 eparam->Peer_Address_Type,
                                                 eparam->Conn_Interval,
                                                 eparam->Conn_Latency,
                                                 eparam->Supervision_Timeout);
                        } else {
                            if (m_peripheral.advertising) {
                                m_peripheral.advertising = false;
                                
#if (BLE_TRACE_SUPPORTED == 1)
                                armv7m_rtt_printf("PROCESS-STOP\r\n");
#endif
                                
                                m_stop_callback();
                            }
                        }
                        break;
                    }
                        
                    case HCI_LE_CONNECTION_UPDATE_COMPLETE_EVENT: {
                        const hci_le_connection_update_complete_event_rp0 *eparam = (const hci_le_connection_update_complete_event_rp0*)&hci_le_event->data[0];
                        
                        if (m_central && (m_central->m_handle == eparam->Connection_Handle)) {
                            m_central->m_connection_interval = eparam->Conn_Interval;
                            m_central->m_slave_latency = eparam->Conn_Latency;
                            m_central->m_supervision_timeout = eparam->Supervision_Timeout;

#if (BLE_TRACE_SUPPORTED == 1)
                            armv7m_rtt_printf("PROCESS-CONNECTION-UPDATE (%d/%d/%d)\r\n", eparam->Conn_Interval, eparam->Conn_Latency, eparam->Supervision_Timeout);
#endif
                            
                            m_central->m_connection_update_callback();
                        }
                        break;
                    }

                    case HCI_LE_LONG_TERM_KEY_REQUEST_EVENT: {
                        // #### negative reply ? or what ?
                        __BKPT();
                        break;
                    }

                    case HCI_LE_DATA_LENGTH_CHANGE_EVENT: {
                        const hci_le_data_length_change_event_rp0 *eparam = (const hci_le_data_length_change_event_rp0*)&hci_le_event->data[0];

#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-LENGTH-CHANGE %d/%d, %d/%d\r\n", eparam->MaxTxOctets, eparam->MaxTxTime, eparam->MaxRxOctets, eparam->MaxRxTime);
#endif
                        break;
                    }
                        
                    case HCI_LE_READ_REMOTE_FEATURES_COMPLETE_EVENT:
                      // case HCI_LE_DATA_LENGTH_CHANGE_EVENT:
                    case HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_COMPLETE_EVENT:
                    case HCI_LE_GENERATE_DHKEY_COMPLETE_EVENT:
                    case HCI_LE_PHY_UPDATE_COMPLETE_EVENT:
                        break;
                    
                    default:
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-UNEXPTECT HCI LE EVENT !!!\n");
#endif
                      //__BKPT();
                        break;
                    }
                    break;

                case HCI_VENDOR_SPECIFIC_EVENT:
                    hci_vs_event = (const evt_blue_aci*)&hci_event->data[0];

                    switch (hci_vs_event->ecode) {

                      /* HAL */
                    case ACI_HAL_END_OF_RADIO_ACTIVITY_EVENT:
                    case ACI_HAL_FW_ERROR_EVENT:
                        break;
                          
                      /* GAP */
                    case ACI_GAP_PAIRING_COMPLETE_EVENT: {
                        const aci_gap_pairing_complete_event_rp0 *eparam = (const aci_gap_pairing_complete_event_rp0*)&hci_vs_event->data[0];

                        armv7m_atomic_and(&m_process.sequence, ~BLE_EVENT_GAP_PAIRING_COMPLETE);

#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-PAIRING %02x\r\n", eparam->Status);
#endif
                        
                        if (eparam->Status == BLE_STATUS_SUCCESS) {
                        } else {
                            armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
                        }
                        break;
                    }

                    case ACI_GAP_BOND_LOST_EVENT: {
                        if (m_peripheral.bonding) {
                            if (m_central) {
                                armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_ALLOW_REBOND);
                            }
                        } else {
                            armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
                        }
                        break;
                    }

                    case ACI_GAP_LIMITED_DISCOVERABLE_EVENT: {
                        if (m_peripheral.advertising) {
                            m_peripheral.advertising = false;

#if (BLE_TRACE_SUPPORTED == 1)
                            armv7m_rtt_printf("PROCESS-STOP\r\n");
#endif
                            
                            m_stop_callback();
                        }
                        break;
                    }
                        
                    case ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT:
                    case ACI_GAP_PROC_COMPLETE_EVENT:
                        break;

                    case ACI_GAP_ADDR_NOT_RESOLVED_EVENT:
                        // ##### ????
                        __BKPT();
                        break;
                        
                    case ACI_GAP_AUTHORIZATION_REQ_EVENT:
                    case ACI_GAP_PASS_KEY_REQ_EVENT:
                    case ACI_GAP_NUMERIC_COMPARISON_VALUE_EVENT:
                    case ACI_GAP_KEYPRESS_NOTIFICATION_EVENT:
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-UNEXPTECT ACI GAP EVENT !!!\n");
#endif
                      // __BKPT();
                        break;
                        
                        
                      /* L2CAP */
                    case ACI_L2CAP_COMMAND_REJECT_EVENT:
                    case ACI_L2CAP_PROC_TIMEOUT_EVENT:
                        break;
                      
