GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
                      /* ATT */
                    case ACI_ATT_EXCHANGE_MTU_RESP_EVENT: {
                        const aci_att_exchange_mtu_resp_event_rp0 *eparam = (const aci_att_exchange_mtu_resp_event_rp0*)&hci_vs_event->data[0];

                        if (m_central && (m_central->m_handle == eparam->Connection_Handle)) {
                            m_central->m_mtu = eparam->Server_RX_MTU;
                        }
                        break;
                    }
                      
                    case ACI_GATT_ATTRIBUTE_MODIFIED_EVENT: {
                        const aci_gatt_attribute_modified_event_rp0 *eparam = (const aci_gatt_attribute_modified_event_rp0 *)&hci_vs_event->data[0];

#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-MODIFIED-EVENT %04x\r\n", eparam->Attr_Handle);
#endif
                        
                        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
                            service = m_process.service_table[index];

                            if (service && (service->m_server.attrib[0] <= eparam->Attr_Handle) && (service->m_server.attrib[1] >= eparam->Attr_Handle)) {
                                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                                    if (eparam->Attr_Handle == (characteristic->m_server.handle + BLE_VALUE_ATTRIB_HANDLE_OFFSET)) {
                                        if (!characteristic->m_written) {
                                            memcpy(&characteristic->m_value[characteristic->m_value_size + (eparam->Offset & 0x7fff)],
                                                   &eparam->Attr_Data[0],
                                                   (eparam->Attr_Data_Length - (eparam->Offset & 0x7fff)));
                                            
                                            if (!(eparam->Offset & 0x8000)) {
                                                characteristic->m_written = (0x8000 | eparam->Attr_Data_Length);
                                                
                                                if (characteristic->m_status != BLE_STATUS_BUSY) {
#if (BLE_TRACE_SUPPORTED == 1)
                                                    armv7m_rtt_printf("PROCESS-WRITTEN (\"%s\")\r\n", characteristic->m_uuid);
#endif
                                                    characteristic->m_written_callback();
                                                }
                                            }
                                        }
                                        break;
                                    }

                                    if (characteristic->m_properties & (BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
                                        if (eparam->Attr_Handle == (characteristic->m_server.handle + BLE_CCCD_ATTRIB_HANDLE_OFFSET)) {
                                          characteristic->m_sync_subscribed = false;
                                          if (characteristic->m_subscribed != (eparam->Attr_Data[0] & 3)) {
                                                characteristic->m_subscribed = (eparam->Attr_Data[0] & 3);
                                                
#if (BLE_TRACE_SUPPORTED == 1)
                                                armv7m_rtt_printf("PROCESS-SUBSCRIBED %02x (\"%s\")\r\n", characteristic->m_subscribed, characteristic->m_uuid);
#endif
                                                
                                                characteristic->m_subscribed_callback();
                                                break;
                                            }
                                        }
                                    }
                                }
                            }
                        }
                        break;
                    }

                    case ACI_GATT_PROC_TIMEOUT_EVENT: {
                        armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GAP_TERMINATE);
                        break;
                    }

                    case ACI_GATT_READ_PERMIT_REQ_EVENT: {
                        const aci_gatt_read_permit_req_event_rp0 *eparam = (const aci_gatt_read_permit_req_event_rp0 *)&hci_vs_event->data[0];

#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-READ-PERMIT-EVENT %04x\r\n", eparam->Attribute_Handle);
#endif
                        
                        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
                            service = m_process.service_table[index];

                            if (service && (service->m_server.attrib[0] <= eparam->Attribute_Handle) && (service->m_server.attrib[1] >= eparam->Attribute_Handle)) {
                                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                                    if (eparam->Attribute_Handle == (characteristic->m_server.handle + BLE_VALUE_ATTRIB_HANDLE_OFFSET)) {
#if (BLE_TRACE_SUPPORTED == 1)
                                        armv7m_rtt_printf("PROCESS-READ (\"%s\")\r\n", characteristic->m_uuid);
#endif
                                        characteristic->m_read_callback();
                                        
                                        if (characteristic->m_update_value) {
                                            characteristic->m_update_value = false;
                                            characteristic->m_sync_value = true;
                                            m_process.sync_value = true;
                                        }
                                        break;
                                    }
                                }
                            }
                        }

                        armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GATT_ALLOW_READ);
                        break;
                    }

                    case ACI_GATT_READ_MULTI_PERMIT_REQ_EVENT: {
                        const aci_gatt_read_multi_permit_req_event_rp0 *eparam = (const aci_gatt_read_multi_permit_req_event_rp0 *)&hci_vs_event->data[0];

