GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
                        for (entry = 0; entry < eparam->Number_of_Handles; entry++) {
#if (BLE_TRACE_SUPPORTED == 1)
                            armv7m_rtt_printf("PROCESS-READ-MULTI-PERMIT-EVENT %04x\r\n", eparam->Handle_Item[entry].Handle);
#endif
                        
                            for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
                                service = m_process.service_table[index];
                                
                                if (service && (service->m_server.attrib[0] <= eparam->Handle_Item[entry].Handle) && (service->m_server.attrib[1] >= eparam->Handle_Item[entry].Handle)) {
                                    for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                                        if (eparam->Handle_Item[entry].Handle == (characteristic->m_server.handle + BLE_VALUE_ATTRIB_HANDLE_OFFSET)) {
#if (BLE_TRACE_SUPPORTED == 1)
                                            armv7m_rtt_printf("PROCESS-READ (\"%s\")\r\n", characteristic->m_uuid);
#endif
                                            characteristic->m_read_callback();
                                            
                                            if (characteristic->m_update_value) {
                                                characteristic->m_update_value = false;
                                                characteristic->m_sync_value = true;
                                                m_process.sync_value = true;
                                            }
                                            break;
                                        }
                                    }
                                }
                            }
                        }

                        armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GATT_ALLOW_READ);
                        break;
                    }
                      
                    case ACI_GATT_TX_POOL_AVAILABLE_EVENT: {
                        armv7m_atomic_and(&m_process.sequence, ~BLE_EVENT_GATT_TX_POOL_AVAILABLE);
                        break;
                    }
                        
                    case ACI_GATT_SERVER_CONFIRMATION_EVENT: {
                        if (m_process.sequence & BLE_EVENT_GATT_SERVER_CONFIRMATION) {
                            armv7m_atomic_and(&m_process.sequence, ~BLE_EVENT_GATT_SERVER_CONFIRMATION);

                            characteristic = m_process.request_current;
                            m_process.request_current = nullptr;

#if (BLE_TRACE_SUPPORTED == 1)
                            armv7m_rtt_printf("PROCESS-DONE %02x (\"%s\", %02x)\r\n", BLE_STATUS_SUCCESS, characteristic->m_uuid, characteristic->m_update_type);
#endif

                            callback = characteristic->m_done_callback;
                            
                            characteristic->m_status = BLE_STATUS_SUCCESS;

                            callback();
                        }
                        break;
                    }

                    case ACI_GATT_INDICATION_EVENT: {
                        const aci_gatt_indication_event_rp0 *eparam = (const aci_gatt_indication_event_rp0*)&hci_vs_event->data[0];

                        if (m_central && (m_central->m_handle == eparam->Connection_Handle)) {
                            if (eparam->Attribute_Handle == (BLE_SERVICE_CHANGED_HANDLE + BLE_VALUE_ATTRIB_HANDLE_OFFSET)) {
                                armv7m_atomic_or(&m_process.sequence, BLE_REQUEST_GATT_CONFIRM_INDICATION);
                            }
                        }
                        break;
                    }
                    case ACI_GATT_PROC_COMPLETE_EVENT:
                    case ACI_GATT_WRITE_PERMIT_REQ_EVENT:
                    case ACI_GATT_PREPARE_WRITE_PERMIT_REQ_EVENT:
                    default:
#if (BLE_TRACE_SUPPORTED == 1)
                      armv7m_rtt_printf("PROCESS-UNEXPECTED ACI ATT/GATT EVENT !!! [%04x]\n", hci_vs_event->ecode);
#endif
                      // __BKPT();
                        break;
                    }
                    break;

                case HCI_COMMAND_COMPLETE_EVENT:
                case HCI_COMMAND_STATUS_EVENT:
                default:
#if (BLE_TRACE_SUPPORTED == 1)
                        armv7m_rtt_printf("PROCESS-UNEXPTECT HCI EVENT !!!\n");
#endif
                    __BKPT();
                    break;
                }
            }
            
            event = (const hci_uart_pckt*)stm32wb_ipcc_ble_event();
        } while (event);
    }
    
    if (m_process.request_submit) {
        request_submit = (class BLEServerCharacteristic *)armv7m_atomic_swap((volatile uint32_t*)&m_process.request_submit, (uint32_t)nullptr);

        for (request_head = nullptr, request_tail = request_submit; request_submit != nullptr; request_submit = request_next)
        {
            request_next = request_submit->m_process.request;

            request_submit->m_process.request = request_head;

            request_head = request_submit;
        }
        
        if (!m_process.request_head)
        {
            m_process.request_head = request_head;
        }
        else
        {
            m_process.request_tail->m_process.request = request_head;
        }
        
        m_process.request_tail = request_tail;
    }
    
    if (!m_process.request_current && m_process.request_head) {
        characteristic = m_process.request_head;
            
        if (m_process.request_head == m_process.request_tail)
        {
            m_process.request_head = NULL;
            m_process.request_tail = NULL;
        }
        else
        {
            m_process.request_head = characteristic->m_process.request;
        }

        m_process.request_current = characteristic;
        m_process.request_offset = 0;
        m_process.request_count = 0;
        m_process.request_length = characteristic->m_value_length;
    }

    if (!m_process.value_current && m_process.sync_value) {
        m_process.sync_value = false;

        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
            service = m_process.service_table[index];
                                    
