GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
            if (service) {
                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                    if (characteristic->m_sync_value) {
                        m_process.value_current = characteristic;
                        m_process.value_offset = 0;
                        m_process.value_count = 0;
                        m_process.value_length = characteristic->m_value_length;
                        m_process.sync_value = true;
                            
                        characteristic->m_sync_value = false;
                        break;
                    }
                }
            }

            if (m_process.value_current) {
                break;
            }
        }
    }

    if (!m_process.subscribed_current && m_process.sync_subscribed) {
        m_process.sync_subscribed = false;

        for (index = 0; index < BLE_NUM_GATT_SERVICES; index++) {
            service = m_process.service_table[index];
                                    
            if (service) {
                for (characteristic = service->m_server.children; characteristic; characteristic = characteristic->m_server.sibling) {
                    if (characteristic->m_sync_subscribed) {
                        m_process.subscribed_current = characteristic;
                        m_process.sync_subscribed = true;

                        characteristic->m_sync_subscribed = false;
                        break;
                    }
                }
            }

            if (m_process.subscribed_current) {
                break;
            }
        }
    }
    
    if (!(m_process.sequence & BLE_BUSY_MASK)) {
        if (m_process.sequence & BLE_REQUEST_GAP_TERMINATE) {
            aci_gap_terminate_cp0 *cparam = (aci_gap_terminate_cp0*)m_process.command.cparam;
            
            armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_GAP_TERMINATE);
            
            cparam->Connection_Handle = m_process.connection;
            cparam->Reason = HCI_CONNECTION_TERMINATED_BY_LOCAL_HOST_ERR_CODE;
            
            m_process.command.opcode = ACI_GAP_TERMINATE;
            m_process.command.clen = sizeof(aci_gap_terminate_cp0);
            
            stm32wb_ipcc_ble_command(&m_process.command);
            
            armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GAP_TERMINATE);
        } else {
            if (m_process.sequence & BLE_REQUEST_GATT_CONFIRM_INDICATION) {
                aci_gatt_confirm_indication_cp0 *cparam = (aci_gatt_confirm_indication_cp0*)m_process.command.cparam;
            
                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_GATT_CONFIRM_INDICATION);
            
                cparam->Connection_Handle = m_central->m_handle;
            
                m_process.command.opcode = ACI_GATT_CONFIRM_INDICATION;
                m_process.command.clen = sizeof(aci_gatt_confirm_indication_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GATT_CONFIRM_INDICATION);
            }

            else if (m_process.sequence & BLE_REQUEST_GAP_SLAVE_SECURITY) {
                aci_gap_slave_security_req_cp0 *cparam = (aci_gap_slave_security_req_cp0*)m_process.command.cparam;

                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_GAP_SLAVE_SECURITY);
            
                cparam->Connection_Handle = m_central->m_handle;
            
                m_process.command.opcode = ACI_GAP_SLAVE_SECURITY_REQ;
                m_process.command.clen = sizeof(aci_gap_slave_security_req_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GAP_SLAVE_SECURITY);
            }

            else if (m_process.sequence & BLE_REQUEST_GAP_ALLOW_REBOND) {
                aci_gap_allow_rebond_cp0 *cparam = (aci_gap_allow_rebond_cp0*)m_process.command.cparam;
            
                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_GAP_ALLOW_REBOND);
            
                cparam->Connection_Handle = m_central->m_handle;
            
                m_process.command.opcode = ACI_GAP_ALLOW_REBOND;
                m_process.command.clen = sizeof(aci_gap_allow_rebond_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GAP_ALLOW_REBOND);
            }
    
            else if (m_process.sequence & BLE_REQUEST_L2CAP_CONNECTION_PARAMETER_UPDATE) {
                aci_l2cap_connection_parameter_update_req_cp0 *cparam = (aci_l2cap_connection_parameter_update_req_cp0*)m_process.command.cparam;

                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_L2CAP_CONNECTION_PARAMETER_UPDATE);
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("REQUEST-CONNECTION-UPDATE (%d:%d/%d/%d)\r\n", m_process.connection_interval_min, m_process.connection_interval_max, m_process.slave_latency, m_process.supervision_timeout);
#endif
            
                cparam->Connection_Handle = m_central->m_handle;
                cparam->Conn_Interval_Min = m_process.connection_interval_min;
                cparam->Conn_Interval_Max = m_process.connection_interval_max;
                cparam->Slave_latency = m_process.slave_latency;
                cparam->Timeout_Multiplier = m_process.supervision_timeout;

                m_process.command.opcode = ACI_L2CAP_CONNECTION_PARAMETER_UPDATE_REQ;
                m_process.command.clen = sizeof(aci_l2cap_connection_parameter_update_req_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_L2CAP_CONNECTION_PARAMETER_UPDATE);
            }
        
            else if (m_process.sequence & BLE_REQUEST_HCI_LE_SET_PHY) {
                hci_le_set_phy_cp0 *cparam = (hci_le_set_phy_cp0*)m_process.command.cparam;
            
