GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_HCI_LE_SET_PHY);
            
                cparam->Connection_Handle = m_central->m_handle;
                cparam->ALL_PHYS = 0;
                cparam->TX_PHYS = m_tx_phy;
                cparam->RX_PHYS = m_rx_phy;
                cparam->PHY_options = m_phy_options;
            
                m_process.command.opcode = HCI_LE_SET_PHY;
                m_process.command.clen = sizeof(hci_le_set_phy_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_HCI_LE_SET_PHY);
            }

            else if (m_process.request_current && !(m_process.sequence & (BLE_EVENT_GATT_TX_POOL_AVAILABLE | BLE_EVENT_GATT_SERVER_CONFIRMATION))) {
                aci_gatt_update_char_value_ext_cp0 *cparam = (aci_gatt_update_char_value_ext_cp0*)m_process.command.cparam;

                characteristic = m_process.request_current;
                
                m_process.request_count = m_process.request_length - m_process.request_offset;
            
                if (m_process.request_count > 243) {
                    m_process.request_count = 243;
                }
            
                cparam->Conn_Handle_To_Notify = m_central ? m_central->m_handle : 0x0000;
                cparam->Service_Handle = characteristic->m_server.parent->m_server.handle;
                cparam->Char_Handle = characteristic->m_server.handle;
                cparam->Update_Type = (m_central && ((m_process.request_offset + m_process.request_count) == m_process.request_length)) ? characteristic->m_update_type : 0x00;
                cparam->Char_Length = m_process.request_length;
                cparam->Value_Offset = m_process.request_offset;
                cparam->Value_Length = m_process.request_count;
                memcpy(&cparam->Value[0], characteristic->m_value, m_process.request_count);
            
                m_process.command.opcode = ACI_GATT_UPDATE_CHAR_VALUE_EXT;
                m_process.command.clen = 12 + m_process.request_count;
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GATT_UPDATE_CHAR_VALUE_EXT);
            }

            else if (m_process.value_current) {
                aci_gatt_update_char_value_ext_cp0 *cparam = (aci_gatt_update_char_value_ext_cp0*)m_process.command.cparam;

                characteristic = m_process.value_current;
                
                m_process.value_count = m_process.value_length - m_process.value_offset;
            
                if (m_process.value_count > 243) {
                    m_process.value_count = 243;
                }
            
                cparam->Conn_Handle_To_Notify = m_central ? m_central->m_handle : 0x0000;
                cparam->Service_Handle = characteristic->m_server.parent->m_server.handle;
                cparam->Char_Handle = characteristic->m_server.handle;
                cparam->Update_Type = 0x00;
                cparam->Char_Length = m_process.value_length;
                cparam->Value_Offset = m_process.value_offset;
                cparam->Value_Length = m_process.value_count;
                memcpy(&cparam->Value[0], characteristic->m_value, m_process.value_count);
            
                m_process.command.opcode = ACI_GATT_UPDATE_CHAR_VALUE_EXT;
                m_process.command.clen = 12 + m_process.value_count;
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GATT_UPDATE_CHAR_VALUE_EXT);
            }
            
            else if (m_process.subscribed_current) {
                aci_gatt_read_handle_value_cp0 *cparam = (aci_gatt_read_handle_value_cp0*)m_process.command.cparam;

                characteristic = m_process.subscribed_current;

                cparam->Attr_Handle = characteristic->m_server.handle + BLE_CCCD_ATTRIB_HANDLE_OFFSET;
                cparam->Offset = 0;
                cparam->Value_Length_Requested = 1;

                m_process.command.opcode = ACI_GATT_READ_HANDLE_VALUE;
                m_process.command.clen = sizeof(aci_gatt_read_handle_value_cp0);
                
                stm32wb_ipcc_ble_command(&m_process.command);
                
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GATT_READ_HANDLE_VALUE);
            }

            else if (m_process.sequence & BLE_REQUEST_GATT_ALLOW_READ) {
                aci_gatt_allow_read_cp0 *cparam = (aci_gatt_allow_read_cp0*)m_process.command.cparam;

                armv7m_atomic_and(&m_process.sequence, ~BLE_REQUEST_GATT_ALLOW_READ);
                
                cparam->Connection_Handle = m_central ? m_central->m_handle : 0x0000;
            
                m_process.command.opcode = ACI_GATT_ALLOW_READ;
                m_process.command.clen = sizeof(aci_gatt_allow_read_cp0);
            
                stm32wb_ipcc_ble_command(&m_process.command);
            
                armv7m_atomic_or(&m_process.sequence, BLE_BUSY_GATT_ALLOW_READ);
            }
        }
    }

#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("PROCESS-EXIT %08x\r\n", (unsigned int)m_process.sequence);
#endif
}

void BLELocalDevice::done() {
    k_work_submit(&m_process.work);
}

void BLELocalDevice::event() {
    k_work_submit(&m_process.work);
}

/**********************************************************************************
 * BLE API
 */

BLEDescriptorInstance *BLEDescriptor::instance(const char *uuid, uint8_t permissions, const void *value, int valueLength) {
    BLEDescriptorInstance *instance;
    uint8_t *data;
    
    uuid = (const char*)allocate_noconst(uuid, strlen(uuid) +1);

    data = (uint8_t*)allocate_noconst(value, valueLength);
    
    if (uuid && value) {
        instance = new BLEServerDescriptor(uuid, permissions, data, valueLength);
    } else {
        instance = nullptr;
    }

    if (instance == nullptr) {
        if (uuid) {
            deallocate_noconst(uuid);
        }

        if (data) {
            deallocate_noconst(data);
        }

        instance = &BLENullDescriptor;
    }

    return instance;
}

BLEDescriptor::BLEDescriptor() {
    m_instance = &BLENullDescriptor;
}

BLEDescriptor::BLEDescriptor(const char *uuid, uint8_t permissions, const void *value, int valueLength) {
    m_instance = instance(uuid, permissions, value, valueLength);
}

BLEDescriptor::BLEDescriptor(const char *uuid, uint8_t permissions, const char *value) {
    m_instance = instance(uuid, permissions, (const void*)value, strlen(value));
}

BLEDescriptor::BLEDescriptor(const char *uuid, const char *value) {
    m_instance = instance(uuid, 0, (const void*)value, strlen(value));
}

BLEDescriptor::~BLEDescriptor() {
    (*m_instance).unreference();
}

