GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
BLEDescriptor::BLEDescriptor(const BLEDescriptor &other) {
    m_instance = other.m_instance;

    (*m_instance).reference();
}

BLEDescriptor &BLEDescriptor::operator=(const BLEDescriptor &other) {
    BLEDescriptorInstance *descriptor = m_instance;

    m_instance = other.m_instance;

    (*m_instance).reference();

    descriptor->unreference();

    return *this;
}

BLEDescriptor::BLEDescriptor(BLEDescriptor &&other) {
    m_instance = other.m_instance;

    other.m_instance = &BLENullDescriptor;
}

BLEDescriptor &BLEDescriptor::operator=(BLEDescriptor &&other) {
    BLEDescriptorInstance *descriptor = m_instance;

    m_instance = other.m_instance;

    other.m_instance = &BLENullDescriptor;

    descriptor->unreference();

    return *this;
}

BLEDescriptor::BLEDescriptor(BLEDescriptorInstance *instance) {
    m_instance = instance;

    instance->reference();
}

BLEDescriptorInstance *BLEDescriptor::instance() {
    return m_instance;
}

BLEDescriptor::operator bool() const {
    return m_instance != &BLENullDescriptor;
}

const char *BLEDescriptor::uuid() const {
    return (*m_instance).uuid();
}

uint8_t BLEDescriptor::permissions() const {
    return (*m_instance).permissions();
}

int BLEDescriptor::valueLength() const {
    return (*m_instance).valueLength();
}

const void * BLEDescriptor::value() const {
    return (*m_instance).value();
}

int BLEDescriptor::getValue(void *value, int length) const {
    return (*m_instance).getValue(value, length);
}


BLECharacteristicInstance *BLECharacteristic::instance(const char *uuid, uint8_t properties, uint8_t permissions, const void *value, int valueLength, int valueSize, bool fixedLength, bool constant) {
    BLECharacteristicInstance *instance;
    uint8_t *data;
    
    if (constant) {
        if (properties & (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_WRITE | BLE_PROPERTY_NOTIFY | BLE_PROPERTY_INDICATE)) {
            return &BLENullCharacteristic;
        }

        data = (uint8_t*)allocate_noconst(value, valueSize);
    } else {
        data = (uint8_t*)malloc(((properties & (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_WRITE)) ? (2 * valueSize) : valueSize));

        if (value) {
            memcpy(data, value, valueLength);
        }
    }

    uuid = (const char*)allocate_noconst(uuid, strlen(uuid) +1);
    
    if (uuid && data) {
        instance = new BLEServerCharacteristic(uuid, properties, permissions, data, valueLength, valueSize, fixedLength, constant);
    } else {
        instance = nullptr;
    }

    if (instance == nullptr) {
        if (uuid) {
            deallocate_noconst(uuid);
        }
        
        if (data) {
            deallocate_noconst(data);
        }
        
        instance = &BLENullCharacteristic;
    }

    return instance;
}

BLECharacteristic::BLECharacteristic() {
    m_instance = &BLENullCharacteristic;
}

BLECharacteristic::BLECharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, const void *value, int valueLength, int valueSize, bool fixedLength) {
    m_instance = instance(uuid, properties, permissions, value, valueLength, valueSize, fixedLength, false);
}

BLECharacteristic::BLECharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, int valueSize, bool fixedLength) {
    m_instance = instance(uuid, properties, permissions, NULL, 0, valueSize, fixedLength, false);
}

BLECharacteristic::BLECharacteristic(const char* uuid, uint8_t properties, uint8_t permissions, const char* value) {
    int valueSize = strlen(value);

    m_instance = instance(uuid, properties, permissions, (uint8_t*)value, valueSize, valueSize, true, true);
}

BLECharacteristic::BLECharacteristic(const char* uuid, uint8_t properties, const char* value) {
    int valueSize = strlen(value);

    m_instance = instance(uuid, properties, 0, (uint8_t*)value, valueSize, valueSize, true, true);
}

BLECharacteristic::~BLECharacteristic() {
    (*m_instance).unreference();
}

BLECharacteristic::BLECharacteristic(const BLECharacteristic &other) {
    m_instance = other.m_instance;

    (*m_instance).reference();
}

BLECharacteristic &BLECharacteristic::operator=(const BLECharacteristic &other) {
    BLECharacteristicInstance *characteristic = m_instance;

    m_instance = other.m_instance;

    (*m_instance).reference();

    characteristic->unreference();

    return *this;
}

BLECharacteristic::BLECharacteristic(BLECharacteristic &&other) {
    m_instance = other.m_instance;

    other.m_instance = &BLENullCharacteristic;
}

BLECharacteristic &BLECharacteristic::operator=(BLECharacteristic &&other) {
    BLECharacteristicInstance *characteristic = m_instance;

    m_instance = other.m_instance;

    other.m_instance = &BLENullCharacteristic;

    characteristic->unreference();

    return *this;
}

BLECharacteristic::BLECharacteristic(BLECharacteristicInstance *instance) {
    m_instance = instance;

    instance->reference();
}

BLECharacteristicInstance *BLECharacteristic::instance() {
    return m_instance;
}

BLECharacteristic::operator bool() const {
    return m_instance != &BLENullCharacteristic;
}

const char *BLECharacteristic::uuid() const {
    return (*m_instance).uuid();
}

uint8_t BLECharacteristic::properties() const {
    return (*m_instance).properties();
}

uint8_t BLECharacteristic::permissions() const {
    return (*m_instance).permissions();
}

bool BLECharacteristic::fixedLength() const {
    return (*m_instance).fixedLength();
}

int BLECharacteristic::valueSize() const {
    return (*m_instance).valueSize();
}

int BLECharacteristic::valueLength() {
    return (*m_instance).valueLength();
}

const void * BLECharacteristic::value() {
    return (*m_instance).value();
}

int BLECharacteristic::getValue(void *value, int length) {
    return (*m_instance).getValue(value, length);
}

bool BLECharacteristic::setValue(const void *value, int length) {
    return (*m_instance).setValue(value, length);
}

bool BLECharacteristic::writeValue(const void *value, int length) {
    return (*m_instance).writeValue(value, length, Callback());
}

bool BLECharacteristic::writeValue(const void *value, int length, void(*callback)(void)) {
    return (*m_instance).writeValue(value, length, Callback(callback));
}

bool BLECharacteristic::writeValue(const void *value, int length, Callback callback) {
    return (*m_instance).writeValue(value, length, callback);
}

uint8_t BLECharacteristic::status() {
    return (*m_instance).status();
}

bool BLECharacteristic::busy() {
    return (*m_instance).busy();
}

