GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
bool BLECharacteristic::written() {
    return (*m_instance).written();
}

bool BLECharacteristic::subscribed() {
    return (*m_instance).subscribed();
}

unsigned int BLECharacteristic::descriptorCount() {
    return (*m_instance).descriptorCount();
}

BLEDescriptor BLECharacteristic::descriptor(unsigned int index) {
    return (*m_instance).descriptor(index);
}

bool BLECharacteristic::addDescriptor(BLEDescriptor &descriptor) {
    return (*m_instance).addDescriptor(descriptor);
}

bool BLECharacteristic::removeDescriptor(BLEDescriptor &descriptor) {
    return (*m_instance).removeDescriptor(descriptor);
}

void BLECharacteristic::onRead(void(*callback)(void)) {
    (*m_instance).onRead(Callback(callback));
}

void BLECharacteristic::onRead(Callback callback) {
    (*m_instance).onRead(callback);
}

void BLECharacteristic::onWritten(void(*callback)(void)) {
    (*m_instance).onWritten(Callback(callback));
}

void BLECharacteristic::onWritten(Callback callback) {
    (*m_instance).onWritten(callback);
}

void BLECharacteristic::onSubscribed(void(*callback)(void)) {
    (*m_instance).onSubscribed(Callback(callback));
}

void BLECharacteristic::onSubscribed(Callback callback) {
    (*m_instance).onSubscribed(callback);
}


BLEServiceInstance *BLEService::instance(const char *uuid) {
    BLEServiceInstance *instance;
    uuid = (const char*)allocate_noconst(uuid, strlen(uuid) +1);

    if (uuid) {
        instance = new BLEServerService(uuid);
    } else {
        instance = nullptr;
    }

    if (instance == nullptr) {
        if (uuid) {
            deallocate_noconst(uuid);
        }

        instance = &BLENullService;
    }

    return instance;
}

BLEService::BLEService() {
    m_instance = &BLENullService;
}

BLEService::BLEService(const char *uuid) {
    m_instance = instance(uuid);
}

BLEService::~BLEService() {
    (*m_instance).unreference();
}

BLEService::BLEService(const BLEService &other) {
    m_instance = other.m_instance;

    (*m_instance).reference();
}

BLEService &BLEService::operator=(const BLEService &other) {
    BLEServiceInstance *service = m_instance;

    m_instance = other.m_instance;

    (*m_instance).reference();

    service->unreference();

    return *this;
}

BLEService::BLEService(BLEService &&other) {
    m_instance = other.m_instance;

    other.m_instance = &BLENullService;
}

BLEService &BLEService::operator=(BLEService &&other) {
    BLEServiceInstance *service = m_instance;

    m_instance = other.m_instance;

    other.m_instance = &BLENullService;

    service->unreference();

    return *this;
}

BLEService::BLEService(BLEServiceInstance *instance) {
    m_instance = instance;

    instance->reference();
}

BLEServiceInstance *BLEService::instance() {
    return m_instance;
}

BLEService::operator bool() const {
    return m_instance != &BLENullService;
}

const char *BLEService::uuid() const {
    return (*m_instance).uuid();
}

unsigned int BLEService::characteristicCount() {
    return (*m_instance).characteristicCount();
}

BLECharacteristic BLEService::characteristic(unsigned int index) {
    return (*m_instance).characteristic(index);
}

bool BLEService::addCharacteristic(BLECharacteristic &characteristic) {
    return (*m_instance).addCharacteristic(characteristic);
}

bool BLEService::removeCharacteristic(BLECharacteristic &characteristic) {
    return (*m_instance).removeCharacteristic(characteristic);
}

void BLEService::onConnect(void(*callback)(void)) {
    (*m_instance).onConnect(Callback(callback));
}

void BLEService::onConnect(Callback callback) {
    (*m_instance).onConnect(callback);
}

void BLEService::onDisconnect(void(*callback)(void)) {
    (*m_instance).onDisconnect(Callback(callback));
}

void BLEService::onDisconnect(Callback callback) {
    (*m_instance).onDisconnect(callback);
}


BLEDevice::BLEDevice() {
    m_instance = &BLENullDevice;
}

BLEDevice::~BLEDevice() {
    m_instance->unreference();
}

BLEDevice::BLEDevice(const BLEDevice &other) {
    m_instance = other.m_instance;

    (*m_instance).reference();
}

BLEDevice &BLEDevice::operator=(const BLEDevice &other) {
    BLEDeviceInstance *device = m_instance;

    m_instance = other.m_instance;

    (*m_instance).reference();

    device->unreference();
    
    return *this;
}

BLEDevice::BLEDevice(BLEDevice &&other) {
    m_instance = other.m_instance;

    other.m_instance = &BLENullDevice;
}

BLEDevice &BLEDevice::operator=(BLEDevice &&other) {
    BLEDeviceInstance *device = m_instance;

    m_instance = other.m_instance;

    other.m_instance = &BLENullDevice;

    device->unreference();

    return *this;
}

BLEDevice::BLEDevice(BLEDeviceInstance *instance) {
    m_instance = instance;

    instance->reference();
}

BLEDeviceInstance *BLEDevice::instance() {
    return m_instance;
}

BLEDevice::operator bool() const {
    return m_instance != &BLENullDevice;
}

String BLEDevice::address() const {
    return (*m_instance).address();
}

bool BLEDevice::connected() {
    return (*m_instance).connected();
}

int BLEDevice::rssi() {
    return (*m_instance).rssi();
}

int BLEDevice::mtu() {
    return (*m_instance).mtu();
}

bool BLEDevice::setConnectionInterval(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval) {
    uint16_t slaveLatency, supervisionTimeout;

    slaveLatency = 0;
    supervisionTimeout = ((((1 + slaveLatency) * (2 * maximumConnectionInterval * 125 + 124)) / 100) + 9) / 10;

    if (supervisionTimeout < 0x00c8) {
        supervisionTimeout = 0x00c8;
    }
    
    return (*m_instance).setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

bool BLEDevice::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency) {
    uint16_t supervisionTimeout;
    
    supervisionTimeout = ((((1 + slaveLatency) * (2 * maximumConnectionInterval * 125 + 124)) / 100) + 9) / 10;

    if (supervisionTimeout < 0x00c8) {
        supervisionTimeout = 0x00c8;
    }
    
    return (*m_instance).setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

bool BLEDevice::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    return (*m_instance).setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

void BLEDevice::getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout) {
    (*m_instance).getConnectionParameters(connectionInterval, slaveLatency, supervisionTimeout);
}

void BLEDevice::onConnectionUpdate(void(*callback)(void)) {
    (*m_instance).onConnectionUpdate(Callback(callback));
}

void BLEDevice::onConnectionUpdate(Callback callback) {
    (*m_instance).onConnectionUpdate(callback);
}


bool BLEClass::begin(int mtu, uint32_t options) {
    return BLEHost.begin(mtu, options);
}

void BLEClass::end() {
    BLEHost.end();
}

String BLEClass::address() {
    return BLEHost.address();
}

bool BLEClass::setTxPowerLevel(int txPower) {
    return BLEHost.setTxPowerLevel(txPower);
}

bool BLEClass::setPreferredPhy(BLEPhy txPhy, BLEPhy rxPhy, BLEPhyOption phyOptions) {
    return BLEHost.setPreferredPhy(txPhy, rxPhy, phyOptions);
}

