GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
void BLEClass::setDeviceName(const char *deviceName) {
    BLEHost.setDeviceName(deviceName);
}

void BLEClass::setAppearance(BLEAppearance appearance) {
    BLEHost.setAppearance(appearance);
}

bool BLEClass::setConnectionInterval(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval) {
    uint16_t slaveLatency, supervisionTimeout;

    slaveLatency = 0;
    supervisionTimeout = ((((1 + slaveLatency) * (2 * maximumConnectionInterval * 125 + 124)) / 100) + 9) / 10;

    if (supervisionTimeout < 0x00c8) {
        supervisionTimeout = 0x00c8;
    }
    
    return setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

bool BLEClass::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency) {
    uint16_t supervisionTimeout;

    supervisionTimeout = ((((1 + slaveLatency) * (2 * maximumConnectionInterval * 125 + 124)) / 100) + 9) / 10;

    if (supervisionTimeout < 0x00c8) {
        supervisionTimeout = 0x00c8;
    }

    return setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

bool BLEClass::setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout) {
    return BLEHost.setConnectionParameters(minimumConnectionInterval, maximumConnectionInterval, slaveLatency, supervisionTimeout);
}

unsigned int BLEClass::serviceCount() {
    return BLEHost.serviceCount();
}

BLEService BLEClass::service(unsigned int index) {
    return BLEHost.service(index);
}

bool BLEClass::addService(BLEService &service) {
    return BLEHost.addService(service);
}

bool BLEClass::removeService(BLEService &service) {
    return BLEHost.removeService(service);
}

bool BLEClass::setSecurity(BLESecurity security) {
    return BLEHost.setSecurity(security);
}

bool BLEClass::setBonding(bool bonding) {
    return BLEHost.setBonding(bonding);
}

bool BLEClass::setPin(const char *pin) {
    return BLEHost.setPin(pin);
}

void BLEClass::clearBondStorage() {
    BLEHost.clearBondStorage();
}

bool BLEClass::setIncludeTxPowerLevel(bool enable) {
    return BLEHost.setIncludeTxPowerLevel(enable);
}

bool BLEClass::setIncludeConnectionInterval(bool enable) {
    return BLEHost.setIncludeConnectionInterval(enable);
}

bool BLEClass::setLocalName(const char *localName) {
    return BLEHost.setLocalName(localName);
}

bool BLEClass::setAdvertisedServiceUuid(const char *uuid, bool complete) {
    return BLE.setAdvertisedServiceUuids(&uuid, 1, complete);
}

bool BLEClass::setAdvertisedServiceUuids(const char *uuids[], int count, bool complete) {
    return BLEHost.setAdvertisedServiceUuids(uuids, count, complete);
}

bool BLEClass::setManufacturerData(const uint8_t data[], int length) {
    return BLEHost.setManufacturerData(data, length);
}

bool BLEClass::setBeacon(const char *uuid, uint16_t major, uint16_t minor, int8_t rssi) {
    return BLEHost.setBeacon(uuid, major, minor, rssi);
}

bool BLEClass::setAdvertisingData(const uint8_t data[], int length) {
    return BLEHost.setAdvertisingData(data, length);
}

bool BLEClass::setScanResponseData(const uint8_t data[], int length) {
    return BLEHost.setScanResponseData(data, length);
}

bool BLEClass::setAdvertisingInterval(uint16_t advertisingInterval) {
    return BLE.setAdvertisingInterval(advertisingInterval, advertisingInterval);
}

bool BLEClass::setAdvertisingInterval(uint16_t minimumAdvertisingInterval, uint16_t maximumAdvertisingInterval) {
    return BLEHost.setAdvertisingInterval(minimumAdvertisingInterval, maximumAdvertisingInterval);
}

void BLEClass::setConnectable(bool connectable) {
    BLEHost.setConnectable(connectable);
}

void BLEClass::setDiscoverable(BLEDiscoverable discoverable) {
    BLEHost.setDiscoverable(discoverable);
}

bool BLEClass::advertise() {
    return BLEHost.advertise();
}

void BLEClass::stopAdvertise() {
    BLEHost.stopAdvertise();
}

bool BLEClass::advertising() {
    return BLEHost.advertising();
}

BLEDevice BLEClass::central() {
    return BLEHost.central();
}

bool BLEClass::connected() {
    return BLEHost.connected();
}

void BLEClass::disconnect() {
    return BLEHost.disconnect();
}

void BLEClass::onStop(void(*callback)(void)) {
    BLE.onStop(Callback(callback));
}

void BLEClass::onStop(Callback callback) {
    BLEHost.onStop(callback);
}

void BLEClass::onConnect(void(*callback)(void)) {
    BLE.onConnect(Callback(callback));
}

void BLEClass::onConnect(Callback callback) {
    BLEHost.onConnect(callback);
}

void BLEClass::onDisconnect(void(*callback)(void)) {
    BLE.onDisconnect(Callback(callback));
}

void BLEClass::onDisconnect(Callback callback) {
    BLEHost.onDisconnect(callback);
}

bool BLEClass::testTransmit(int channel, int length, BLEPayload payload, BLEPhy phy) {
    return BLEHost.testTransmit(channel, length, payload, phy);
}

bool BLEClass::testReceive(int channel, BLEPhy phy, int modulation) {
    return BLEHost.testReceive(channel, phy, modulation);
}

uint32_t BLEClass::testStop() {
    return BLEHost.testStop();
}

bool BLEClass::testing() {
    return BLEHost.testing();
}

BLEClass BLE;




static const char *BLEUartServiceUUIDs[] = {
    "00000000-000E-11E1-9AB4-0002A5D5C51B",
    "6E400001-B5A3-F393-E0A9-E50E24DCCA9E",
    "0000FFE0-0000-1000-8000-00805F9B34FB",
};

BLEUart::BLEUart(BLEUartProtocol protocol) :
    BLEService(BLEUartServiceUUIDs[(unsigned int)protocol]),
    m_protocol(protocol)
{
    switch (protocol) {
    case BLE_UART_PROTOCOL_BLUEST:
        m_packet_size = 20;

        m_rx_characteristic = BLECharacteristic("00000001-000E-11E1-AC36-0002A5D5C51B", (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_NOTIFY), 0, m_packet_size, false);
        m_tx_characteristic = m_rx_characteristic;
        m_tx2_characteristic = BLECharacteristic("00000002-000E-11E1-AC36-0002A5D5C51B", BLE_PROPERTY_NOTIFY, 0, m_packet_size, false);

