GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
        addCharacteristic(m_rx_characteristic);
        addCharacteristic(m_tx2_characteristic);
        break;

    case BLE_UART_PROTOCOL_NORDIC:
        m_packet_size = 20;

        m_rx_characteristic = BLECharacteristic("6E400002-B5A3-F393-E0A9-E50E24DCCA9E", BLE_PROPERTY_WRITE_WITHOUT_RESPONSE, 0, m_packet_size, false);
        m_tx_characteristic = BLECharacteristic("6E400003-B5A3-F393-E0A9-E50E24DCCA9E", BLE_PROPERTY_NOTIFY, 0, m_packet_size, false);

        addCharacteristic(m_rx_characteristic);
        addCharacteristic(m_tx_characteristic);
        break;

    case BLE_UART_PROTOCOL_HMSOFT:
        m_packet_size = 20;

        m_rx_characteristic = BLECharacteristic("0000FFE1-0000-1000-8000-00805F9B34FB", (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE | BLE_PROPERTY_NOTIFY), 0, m_packet_size, false);
        m_tx_characteristic = m_rx_characteristic;

        addCharacteristic(m_rx_characteristic);
        break;
    }
    
    m_rx_characteristic.onWritten(Callback(&BLEUart::receive, this));
    m_tx_characteristic.onSubscribed(Callback(&BLEUart::connect, this));

    m_receive_callback = Callback();
}

BLEUart::~BLEUart() {
}

BLEUart::operator bool() {
    return m_connected;
}

int BLEUart::available() {
    return m_rx_count;
}

int BLEUart::peek() {
    if (m_rx_count == 0) {
        return -1;
    }
        
    return m_rx_data[m_rx_read];
}

int BLEUart::read() {
    uint32_t rx_read, rx_read_next;
    uint8_t data;

    do {
        if (!m_rx_count) {
            return -1;
        }
        
        rx_read = m_rx_read;
        rx_read_next = (unsigned int)(rx_read + 1) & (BLE_UART_RX_BUFFER_SIZE -1);
    } while (armv7m_atomic_cash(&m_rx_read, rx_read, rx_read_next) != rx_read);

    data = m_rx_data[rx_read];
    
    armv7m_atomic_subh(&m_rx_count, 1);

    return data;
}

int BLEUart::read(uint8_t *buffer, size_t size) {
    uint32_t count, rx_count, rx_read, rx_read_next;

    count = 0;

    while (count < size) {
        do {
            rx_count = m_rx_count;

            if (!rx_count) {
                return count;
            }
            
            rx_read = m_rx_read;
            
            if (rx_count > (BLE_UART_RX_BUFFER_SIZE - rx_read)) {
                rx_count = (BLE_UART_RX_BUFFER_SIZE - rx_read);
            }
            
            if (rx_count > (size - count)) {
                rx_count = (size - count);
            }

            rx_read_next = (unsigned int)(rx_read + count) & (BLE_UART_RX_BUFFER_SIZE -1);
        } while (armv7m_atomic_cash(&m_rx_read, rx_read, rx_read_next) != rx_read);
    
        memcpy(&buffer[count], &m_rx_data[rx_read], rx_count);
        count += rx_count;
    
        armv7m_atomic_subh(&m_rx_count, rx_count);
    }

    return count;
}

int BLEUart::availableForWrite() {
    return BLE_UART_TX_BUFFER_SIZE - m_tx_count;
}

size_t BLEUart::write(uint8_t data) {
    return write(&data, 1);
}

size_t BLEUart::write(const uint8_t *buffer, size_t size) {
    uint32_t count, tx_read, tx_write, tx_write_next, tx_count, tx_size;

    if (size == 0) {
        return 0;
    }

    if (!m_connected) {
        return size;
    }
    
    count = 0;

    while (count < size) {
        tx_count = BLE_UART_TX_BUFFER_SIZE - m_tx_count;

        if (!tx_count) {
            if (m_nonblocking || armv7m_core_is_in_interrupt()) {
                break;
            }

            if (!armv7m_atomic_casb(&m_tx_busy, false, true) == false) {
                tx_size = m_tx_count;
                tx_read = m_tx_read;

                if (tx_size > (BLE_UART_TX_BUFFER_SIZE - tx_read)) {
                    tx_size = (BLE_UART_TX_BUFFER_SIZE - tx_read);
                }
                
                if (tx_size > m_packet_size) {
                    tx_size = m_packet_size;
                }
                
                m_tx_size = tx_size;
                
                while (!m_tx_characteristic.writeValue(&m_tx_data[tx_read], tx_size, Callback(&BLEUart::transmit, this))) { }
            }

            while (m_tx_busy) { __WFE(); }
        } else {
            tx_write = m_tx_write;
            
            if (tx_count > (BLE_UART_TX_BUFFER_SIZE - tx_write)) {
                tx_count = (BLE_UART_TX_BUFFER_SIZE - tx_write);
            }
            
            if (tx_count > (size - count)) {
                tx_count = (size - count);
            }
            
            tx_write_next = (unsigned int)(tx_write + tx_count) & (BLE_UART_TX_BUFFER_SIZE -1);
            
            if (armv7m_atomic_cash(&m_tx_write, tx_write, tx_write_next) == tx_write) {
                memcpy(&m_tx_data[tx_write], &buffer[count], tx_count);
                count += tx_count;

                armv7m_atomic_addh(&m_tx_count, tx_count);
            }
        }
    }

    if (armv7m_atomic_casb(&m_tx_busy, false, true) == false) {
        tx_size = m_tx_count;
        
        if (tx_size) {
            tx_read = m_tx_read;
            
            if (tx_size > (BLE_UART_TX_BUFFER_SIZE - tx_read)) {
                tx_size = (BLE_UART_TX_BUFFER_SIZE - tx_read);
            }
            
            if (tx_size > m_packet_size) {
                tx_size = m_packet_size;
            }
            
            m_tx_size = tx_size;
            
            if (!m_tx_characteristic.writeValue(&m_tx_data[tx_read], tx_size, Callback(&BLEUart::transmit, this))) {
                m_tx_busy = false;
            }
        } else {
            m_tx_busy = false;
        }
    }

    return count;
}

void BLEUart::flush() {
    if (!armv7m_core_is_in_interrupt()) {
        while (m_tx_busy) {
            __WFE();
        }
    }
}

void BLEUart::transmit() {
    unsigned int tx_read, tx_size;

    m_tx_read = (m_tx_read + m_tx_size) & (BLE_UART_TX_BUFFER_SIZE -1);
    armv7m_atomic_subh(&m_tx_count, m_tx_size);
        
    m_tx_size = 0;

    tx_size = m_tx_count;

    if (tx_size) {
        tx_read = m_tx_read;

        if (tx_size > (BLE_UART_TX_BUFFER_SIZE - tx_read)) {
            tx_size = (BLE_UART_TX_BUFFER_SIZE - tx_read);
        }
        
        if (tx_size > m_packet_size) {
            tx_size = m_packet_size;
        }
        
