GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
        m_tx_size = tx_size;
        
        while (!m_tx_characteristic.writeValue(&m_tx_data[tx_read], tx_size, Callback(&BLEUart::transmit, this))) {
            receive();
        }
    } else {
        m_tx_busy = false;
    }
}

void BLEUart::receive() {
    uint32_t rx_count, rx_size, rx_write;
    const uint8_t *rx_data;

    if (m_rx_characteristic.written()) {
        rx_count = m_rx_characteristic.valueLength();
        rx_data = (const uint8_t *)m_rx_characteristic.value();

        rx_write = m_rx_write;
        
        if (rx_count) {
            if (rx_count > (unsigned)(BLE_UART_RX_BUFFER_SIZE - m_rx_count)) {
                rx_count = (BLE_UART_RX_BUFFER_SIZE - m_rx_count);
            }
            
            rx_size = rx_count;
            
            if (rx_size > (BLE_UART_RX_BUFFER_SIZE - rx_write)) {
                rx_size = BLE_UART_RX_BUFFER_SIZE - rx_write;
            }
            
            if (rx_size) {
                memcpy(&m_rx_data[rx_write], &rx_data[0], rx_size);
                
                rx_count -= rx_size;
                rx_write += rx_size;
                
                if (rx_write == BLE_UART_RX_BUFFER_SIZE) {
                    rx_write = 0;
                }
            }
        
            if (rx_count) {
                memcpy(&m_rx_data[rx_write], &rx_data[rx_size], rx_count);
            
                rx_write += rx_count;
                
                if (rx_write == BLE_UART_RX_BUFFER_SIZE) {
                    rx_write = 0;
                }
            }

            armv7m_atomic_addh(&m_rx_count, (rx_size + rx_count));

            m_rx_write = rx_write;
            
            m_receive_callback();
        }
    }
}

void BLEUart::connect() {
    m_connected = !!m_tx_characteristic.subscribed();
}

void BLEUart::setNonBlocking(bool enabled) {
    m_nonblocking = enabled;
}

void BLEUart::onReceive(void(*callback)(void)) {
    onReceive(Callback(callback));
}

void BLEUart::onReceive(Callback callback) {
    m_receive_callback = callback;
}

#define BLE_OTA_PROTOCOL_WB                        0
#define BLE_OTA_PROTOCOL_WB_READY                  1
#define BLE_OTA_PROTOCOL_WB_EXTENDED               2

#define BLE_OTA_COMMAND_SIZE                       5

#define BLE_OTA_COMMAND_STOP                       0x00
#define BLE_OTA_COMMAND_START_WIRELESS             0x01
#define BLE_OTA_COMMAND_START_APPLICATION          0x02
#define BLE_OTA_COMMAND_FINISH                     0x07
#define BLE_OTA_COMMAND_CANCEL                     0x08

#define BLE_OTA_EVENT_SIZE                         1

#define BLE_OTA_EVENT_REBOOT_CONFIRMED             0x01 // WB
#define BLE_OTA_EVENT_ALLOW                        0x02 // WB_READY "Ready To Receive File"
#define BLE_OTA_EVENT_DENY                         0x03 // WB_READY "Error Not Free"

#define BLE_OTA_EVENT_EXTENDED                     0x80
#define BLE_OTA_EVENT_CANCEL                       0x80 // WB_EXTENDED "Canceled"
#define BLE_OTA_EVENT_ERR_TARGET                   0x81 // WB_EXTENDED "Data not for this device"
#define BLE_OTA_EVENT_ERR_FILE                     0x82 // WB_EXTENDED "Data corrupted"
#define BLE_OTA_EVENT_ERR_WRITE                    0x83 // WB_EXTENDED "Data overflow"
#define BLE_OTA_EVENT_ERR_ERASE                    0x84 // WB_EXTENDED "FLASH erase failure"
#define BLE_OTA_EVENT_ERR_CHECK_ERASED             0x85 // WB_EXTENDED "FLASH erase check failure"
#define BLE_OTA_EVENT_ERR_PROGRAM                  0x86 // WB_EXTENDED "FLASH program failure"
#define BLE_OTA_EVENT_ERR_VERIFY                   0x87 // WB_EXTENDED "FLASH program check failure"
#define BLE_OTA_EVENT_ERR_ADDRESS                  0x88 // WB_EXTENDED "FLASH program address out of bounds"
#define BLE_OTA_EVENT_ERR_INTERNAL                 0x8a // WB_EXTENDED "Internal Error"

#define BLE_OTA_DATA_SIZE                          244

#define BLE_OTA_COUNT_SIZE                         2

#define BLE_OTA_STATE_BEGIN                        0
#define BLE_OTA_STATE_STOP                         1
#define BLE_OTA_STATE_START                        2
#define BLE_OTA_STATE_FINISH                       3
#define BLE_OTA_STATE_REBOOT                       4

#define BLE_OTA_PROGRAM_SIZE                       1024

#define BLE_OTA_SEQUENCE_ACCEPT                     0x01
#define BLE_OTA_SEQUENCE_REJECT                     0x02
#define BLE_OTA_SEQUENCE_BEGIN                      0x04
#define BLE_OTA_SEQUENCE_START                      0x08
#define BLE_OTA_SEQUENCE_FINISH                     0x10
#define BLE_OTA_SEQUENCE_CONFIRM                    0x20
#define BLE_OTA_SEQUENCE_CANCEL                     0x40

typedef struct __attribute__((packed)) _ble_ota_command_t {
    uint8_t command;
    uint8_t address[3];
    uint8_t sectors;
} ble_ota_command_t;

typedef struct __attribute__((packed)) _ble_ota_event_t {
    uint8_t event;
} ble_ota_event_t;

typedef struct __attribute__((packed)) _ble_ota_count_t {
    uint16_t count;
} ble_ota_count_t;

BLEOta::BLEOta() :
    BLEService("0000fe20-cc7a-482a-984a-7f2ed5b3e58f")
{
    m_busy = false;
    m_state = BLE_OTA_STATE_BEGIN;
    m_protocol = BLE_OTA_PROTOCOL_WB;
    m_component = STM32WB_FWU_COMPONENT_NONE;
    m_deny = 2;
    m_options = 0;
    m_sequence = 0;

    m_head = 0;
    m_tail = 0;
    m_offset = 0;
    m_size = 0;

    m_work = K_WORK_INIT(BLEOta::processCallback, (void*)this);

    m_command_characteristic = BLECharacteristic("0000fe22-8e22-4541-9d4c-21edae82ed19", (BLE_PROPERTY_WRITE_WITHOUT_RESPONSE), 0, BLE_OTA_COMMAND_SIZE, false);
    m_event_characteristic = BLECharacteristic("0000fe23-8e22-4541-9d4c-21edae82ed19", (BLE_PROPERTY_INDICATE), 0, BLE_OTA_EVENT_SIZE, true);
    m_data_characteristic = BLECharacteristic("0000fe24-8e22-4541-9d4c-21edae82ed19", (BLE_PROPERTY_READ | BLE_PROPERTY_WRITE_WITHOUT_RESPONSE), 0, BLE_OTA_DATA_SIZE, false);

    m_start_callback = Callback();
    m_finish_callback = Callback();
    
    m_command_characteristic.onWritten(Callback(&BLEOta::commandCallback, this));
    m_data_characteristic.onWritten(Callback(&BLEOta::dataCallback, this));
    m_data_characteristic.onRead(Callback(&BLEOta::countCallback, this));
    
