GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    addCharacteristic(m_command_characteristic);
    addCharacteristic(m_event_characteristic);
    addCharacteristic(m_data_characteristic);

    onConnect(Callback(&BLEOta::connectCallback, this));
    onDisconnect(Callback(&BLEOta::disconnectCallback, this));
}

bool BLEOta::begin(uint32_t options) {
    if (m_state != BLE_OTA_STATE_BEGIN) {
        return false;
    }

    m_options = options;

    armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_BEGIN);

    k_work_submit(&m_work);
    
    return true;
}

uint32_t BLEOta::state() {
    uint32_t state = stm32wb_fwu_state();

    if (state == STM32WB_FWU_STATE_READY) {
        return BLE_OTA_STATE_READY;
    }

    if (state >= STM32WB_FWU_STATE_FAILED) {
        return state - (STM32WB_FWU_STATE_FAILED - BLE_OTA_STATE_FAILED);
    }
    
    return BLE_OTA_STATE_BUSY;
}

void BLEOta::accept() {
    if (m_state == BLE_OTA_STATE_BEGIN) {
        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_ACCEPT);

        k_work_submit(&m_work);
    }
}

void BLEOta::reject() {
    if (m_state == BLE_OTA_STATE_BEGIN) {
        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_ACCEPT);

        k_work_submit(&m_work);
    }
}

void BLEOta::allow() {
    __armv7m_atomic_andb(&m_deny, ~1);
}

void BLEOta::deny() {
    __armv7m_atomic_orb(&m_deny, 1);
}

void BLEOta::confirm() {
    if (m_state == BLE_OTA_STATE_FINISH) {
        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_CONFIRM);

        k_work_submit(&m_work);
    }
}

void BLEOta::cancel() {
    if (m_state == BLE_OTA_STATE_FINISH) {
        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_CANCEL);

        k_work_submit(&m_work);
    }
}

void BLEOta::onStart(void(*callback)(void)) {
    m_start_callback = Callback(callback);
}

void BLEOta::onStart(Callback callback) {
    m_start_callback = callback;
}

void BLEOta::onFinish(void(*callback)(void)) {
    m_finish_callback = Callback(callback);
}

void BLEOta::onFinish(Callback callback) {
    m_finish_callback = callback;
}

void BLEOta::acceptCallback(class BLEOta *self) {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("ACCEPT\n");
#endif

    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::rejectCallback(class BLEOta *self) {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("REJECT\n");
#endif

    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::beginCallback(class BLEOta *self) {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("BEGIN\n");
#endif

    __armv7m_atomic_andb(&self->m_deny, ~2);
    
    self->m_state = BLE_OTA_STATE_STOP;

    self->m_busy = false;
    
    k_work_submit(&self->m_work);
}

void BLEOta::startCallback(class BLEOta *self) {
    ble_ota_event_t event;
    
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("START(%d)\n", self->m_request.status);
#endif

    self->m_status = 0;
    
    if (self->m_request.status == STM32WB_FWU_STATUS_NO_ERROR) {
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("### ALLOW ###\n");
#endif

        if (self->m_protocol >= BLE_OTA_PROTOCOL_WB_READY) {
            event.event = BLE_OTA_EVENT_ALLOW;
            
            self->m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
        }
    } else {
#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("### DENY ###\n");
#endif

        if (!self->m_status) {
            self->m_status = BLE_OTA_EVENT_EXTENDED + self->m_request.status;
        }
        armv7m_atomic_orb(&self->m_sequence, BLE_OTA_SEQUENCE_CANCEL);

        if (self->m_protocol >= BLE_OTA_PROTOCOL_WB_READY) {
            event.event = BLE_OTA_EVENT_DENY;
            
            self->m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
        }
    }

    self->m_busy = false;
    
    k_work_submit(&self->m_work);
}

void BLEOta::writeCallback(class BLEOta *self) {
    if (self->m_request.status == STM32WB_FWU_STATUS_NO_ERROR) {
        self->m_head += self->m_size;

        if (self->m_head >= BLE_OTA_QUEUE_SIZE) {
            self->m_head -= BLE_OTA_QUEUE_SIZE;
        }
        
        self->m_offset += self->m_size;
        self->m_size = 0;
    
#if (BLE_TRACE_SUPPORTED == 1)
        {
            uint32_t head, tail, level;
            
            head = self->m_head;
            tail = self->m_tail;
            
            if (tail >= head) {
                level = tail - head;
            } else {
                level = (BLE_OTA_QUEUE_SIZE - head) + tail;
            }
            
            armv7m_rtt_printf("WRITE(%d)\n", (BLE_OTA_QUEUE_SIZE - level - 1));
        }
#endif
    } else {
        if (!self->m_status) {
            self->m_status = BLE_OTA_EVENT_EXTENDED + self->m_request.status;
        }
        armv7m_atomic_orb(&self->m_sequence, BLE_OTA_SEQUENCE_CANCEL);
    }
    
    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::finishCallback(class BLEOta *self) {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("FINISH (%d)\n", self->m_request.status);
#endif

    if (self->m_request.status == STM32WB_FWU_STATUS_NO_ERROR) {
        self->m_state = BLE_OTA_STATE_FINISH;

        self->m_finish_callback();

        if (!(self->m_options & BLE_OTA_OPTION_CANDIDATE)) {
            armv7m_atomic_orb(&self->m_sequence, BLE_OTA_SEQUENCE_CONFIRM);
        }
    } else {
        if (!self->m_status) {
            self->m_status = BLE_OTA_EVENT_EXTENDED + self->m_request.status;
        }
        armv7m_atomic_orb(&self->m_sequence, BLE_OTA_SEQUENCE_CANCEL);
    }
    
    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::confirmCallback(class BLEOta *self) {
    ble_ota_event_t event;
    
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("CONFIRM (%d)\n", self->m_request.status);
#endif

    if (self->m_request.status == STM32WB_FWU_STATUS_NO_ERROR) {
        self->m_state = BLE_OTA_STATE_REBOOT;

        event.event = BLE_OTA_EVENT_REBOOT_CONFIRMED;
            
        self->m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE, BLEOta::rebootCallback);
    } else {
        if (!self->m_status) {
            self->m_status = BLE_OTA_EVENT_EXTENDED + self->m_request.status;
        }
        armv7m_atomic_orb(&self->m_sequence, BLE_OTA_SEQUENCE_CANCEL);
    }
    
    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::rebootCallback() {
    stm32wb_usbd_disable();
    
    stm32wb_system_reset();
}

void BLEOta::cancelCallback(class BLEOta *self) {
    ble_ota_event_t event;
    
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("CANCEL\n");
#endif

