GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
    if (self->m_protocol >= BLE_OTA_PROTOCOL_WB_EXTENDED) {
        event.event = self->m_status ? self->m_status : BLE_OTA_EVENT_CANCEL;
        
        self->m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
    }
    
    self->m_state = BLE_OTA_STATE_STOP;
    self->m_status = 0;
    self->m_protocol = BLE_OTA_PROTOCOL_WB;
    self->m_head = 0;
    self->m_tail = 0;
    self->m_offset = 0;
    self->m_size = 0;
    
    self->m_busy = false;

    k_work_submit(&self->m_work);
}

void BLEOta::processCallback(class BLEOta *self) {
    uint32_t fwu_state, head, tail, level, size, sequence;
    ble_ota_event_t event;
    
    if (self->m_busy) {
        return;
    }

    fwu_state = stm32wb_fwu_state();
    
    sequence = self->m_sequence;

    if (sequence & BLE_OTA_SEQUENCE_ACCEPT) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_ACCEPT);

        self->m_busy = true;
                
        self->m_request.control = STM32WB_FWU_CONTROL_ACCEPT;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::acceptCallback;
        self->m_request.context = self;
        
        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }
        
        self->m_busy = false;
    }

    if (sequence & BLE_OTA_SEQUENCE_REJECT) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_REJECT);

        self->m_busy = true;
                
        self->m_request.control = STM32WB_FWU_CONTROL_REJECT;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::rejectCallback;
        self->m_request.context = self;
        
        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }
        
        self->m_busy = false;
    }

    if (sequence & BLE_OTA_SEQUENCE_BEGIN) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_BEGIN);

        if (fwu_state == STM32WB_FWU_STATE_READY) {
            __armv7m_atomic_andb(&self->m_deny, ~2);

            self->m_state = BLE_OTA_STATE_STOP;
        } else {
            self->m_busy = true;
            
            self->m_request.control = STM32WB_FWU_CONTROL_CLEAN;
            
            if (fwu_state == STM32WB_FWU_STATE_TRIAL) {
                self->m_request.control |= STM32WB_FWU_CONTROL_ACCEPT;
            } else {
                if ((fwu_state != STM32WB_FWU_STATE_FAILED) && (fwu_state != STM32WB_FWU_STATE_UPDATED)) {
                    self->m_request.control |= STM32WB_FWU_CONTROL_CANCEL;
                }
            }
            
            self->m_request.offset = 0;
            self->m_request.data = NULL;
            self->m_request.size = 0;
            self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::beginCallback;
            self->m_request.context = self;
            
            if (stm32wb_fwu_request(&self->m_request)) {
                return;
            }
            
            self->m_busy = false;
        }
    }
        
    if (sequence & BLE_OTA_SEQUENCE_START) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_START);

        self->m_busy = true;

        self->m_request.control = STM32WB_FWU_CONTROL_START;
        self->m_request.component = self->m_component;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::startCallback;
        self->m_request.context = self;

        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }

#if (BLE_TRACE_SUPPORTED == 1)
        armv7m_rtt_printf("### DENY ###\n");
#endif

        if (self->m_protocol >= BLE_OTA_PROTOCOL_WB_READY) {
            event.event = BLE_OTA_EVENT_DENY;
            
            self->m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
        }
        
        self->m_busy = false;
    }

    if ((fwu_state == STM32WB_FWU_STATE_WRITING) && !(sequence & BLE_OTA_SEQUENCE_CANCEL)) { 
        head = self->m_head;
        tail = self->m_tail;
        
        if (head != tail) {
            if (tail >= head) {
                level = tail - head;
            } else {
                level = (BLE_OTA_QUEUE_SIZE - head) + tail;
            }

            if ((level >= BLE_OTA_PROGRAM_SIZE) || (sequence & BLE_OTA_SEQUENCE_FINISH)) {
                size = BLE_OTA_PROGRAM_SIZE;
                if (size > level) {
                    size = level;
                }
                
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("DEQUEUE(%d) [%08x/%d]\n", (BLE_OTA_QUEUE_SIZE - level -1), self->m_offset, ((size + 7) & ~7));
#endif                
                self->m_busy = true;

                self->m_size = size;
                
                self->m_request.control = STM32WB_FWU_CONTROL_WRITE;
                self->m_request.offset = self->m_offset;
                self->m_request.data = &self->m_data[self->m_head];
                self->m_request.size = ((size + 7) & ~7);
                self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::writeCallback;
                self->m_request.context = self;
                
                if (stm32wb_fwu_request(&self->m_request)) {
                    return;
                }

                self->m_busy = false;

                if (!self->m_status) {
                    self->m_status = BLE_OTA_EVENT_ERR_INTERNAL;
                }
                
                sequence |= BLE_OTA_SEQUENCE_CANCEL;
            }
        }
    }

    if ((sequence & BLE_OTA_SEQUENCE_FINISH) && !(sequence & BLE_OTA_SEQUENCE_CANCEL)) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_FINISH);

        self->m_busy = true;

        self->m_request.control = STM32WB_FWU_CONTROL_FINISH;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::finishCallback;
        self->m_request.context = self;

