GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }

        self->m_busy = true;
    }

    if ((sequence & BLE_OTA_SEQUENCE_CONFIRM) && !(sequence & BLE_OTA_SEQUENCE_CANCEL)) {
        armv7m_atomic_andb(&self->m_sequence, ~BLE_OTA_SEQUENCE_CONFIRM);

        self->m_busy = true;

        self->m_request.control = STM32WB_FWU_CONTROL_INSTALL;
        self->m_request.mode = (self->m_options & BLE_OTA_OPTION_TRIAL) ? STM32WB_FWU_MODE_TRIAL : STM32WB_FWU_MODE_ACCEPT;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::confirmCallback;
        self->m_request.context = self;

        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }

        self->m_busy = true;
    }

    if (sequence & BLE_OTA_SEQUENCE_CANCEL) {
        self->m_sequence = sequence = 0;

        self->m_busy = true;

        self->m_request.control = STM32WB_FWU_CONTROL_CANCEL | STM32WB_FWU_CONTROL_CLEAN;
        self->m_request.offset = 0;
        self->m_request.data = NULL;
        self->m_request.size = 0;
        self->m_request.callback = (stm32wb_fwu_done_callback_t)BLEOta::cancelCallback;
        self->m_request.context = self;

        if (stm32wb_fwu_request(&self->m_request)) {
            return;
        }

        self->m_busy = true;
        self->m_protocol = BLE_OTA_PROTOCOL_WB;
    }
}

void BLEOta::connectCallback() {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("CONNECT\n");
#endif
}

void BLEOta::disconnectCallback() {
#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("DISCONNECT\n");
#endif

    if (stm32wb_fwu_state() != STM32WB_FWU_STATE_READY) {
        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_CANCEL);

        k_work_submit(&m_work);
    }
}

void BLEOta::commandCallback() {
    uint32_t length;
    uint8_t data[BLE_OTA_COMMAND_SIZE];
    ble_ota_event_t event;
    
    if (m_command_characteristic.written()) {
      length = m_command_characteristic.getValue(&data[0], sizeof(data));

        if (length) {
            switch (data[0]) {
            case BLE_OTA_COMMAND_STOP: {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("STOP\n");
#endif
                break;
            }
                
            case BLE_OTA_COMMAND_START_WIRELESS: {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("START_WIRELESS\n");
#endif

                if (length == 5) {
                    m_protocol = (data[4] == 0xff) ? BLE_OTA_PROTOCOL_WB_EXTENDED : BLE_OTA_PROTOCOL_WB_READY;
                }

                if (m_options & BLE_OTA_OPTION_WIRELESS) {
                    if (m_state == BLE_OTA_STATE_STOP) {
                        m_start_callback();

                        if (!m_deny) {
                            m_state = BLE_OTA_STATE_START;
                            m_component = STM32WB_FWU_COMPONENT_WIRELESS;
                            
                            armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_START);
                            
                            k_work_submit(&m_work);
                            
                            return;
                        }
                    }
                }
                
                if (m_protocol >= BLE_OTA_PROTOCOL_WB_READY) {
                    event.event = BLE_OTA_EVENT_DENY;
            
                    m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
                }
                break;
            }
                
            case BLE_OTA_COMMAND_START_APPLICATION: {
#if (BLE_TRACE_SUPPORTED == 1)
              armv7m_rtt_printf("START_APPLICATION %02x %02x %02x %02x %02x\n", data[0], data[1], data[2], data[3], data[4]);
#endif

                if (length == 5) {
                    m_protocol = (data[4] == 0xff) ? BLE_OTA_PROTOCOL_WB_EXTENDED : BLE_OTA_PROTOCOL_WB_READY;
                }

                if (m_state == BLE_OTA_STATE_STOP) {
                    m_start_callback();

                    if (!m_deny) {
                        m_state = BLE_OTA_STATE_START;
                        m_component = STM32WB_FWU_COMPONENT_APPLICATION;
                        
                        armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_START);
                        
                        k_work_submit(&m_work);
                        
                        return;
                    }
                }
                
                if (m_protocol >= BLE_OTA_PROTOCOL_WB_READY) {
                    event.event = BLE_OTA_EVENT_DENY;
            
                    m_event_characteristic.writeValue(&event, BLE_OTA_EVENT_SIZE);
                }
                break;
            }
            
            case BLE_OTA_COMMAND_FINISH: {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("FINISH\n");
#endif

                if (m_state == BLE_OTA_STATE_START) {
                    armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_FINISH);

                    k_work_submit(&m_work);

                    return;
                }
                break;
            }
            
            case BLE_OTA_COMMAND_CANCEL: {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("CANCEL\n");
#endif

                if ((m_state == BLE_OTA_STATE_START) || (m_state == BLE_OTA_STATE_FINISH)) {
                    armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_CANCEL);

                    k_work_submit(&m_work);

                    return;
                }
                break;
            }

            default:
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("UNKNOWN %02x (%d)\n", data[0], length);
#endif                
                break;
            }
        }
    }
}

void BLEOta::dataCallback() {
    uint32_t head, tail, level, count, size;
    uint8_t data[BLE_OTA_DATA_SIZE];
    
    if (m_data_characteristic.written()) {
        size = m_data_characteristic.getValue(&data[0], BLE_OTA_DATA_SIZE);

        if (m_state == BLE_OTA_STATE_START) {
            head = m_head;
            tail = m_tail;

