GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.cpp
            if (tail >= head) {
                level = tail - head;
            } else {
                level = (BLE_OTA_QUEUE_SIZE - head) + tail;
            }
            
            if ((BLE_OTA_QUEUE_SIZE - level - 1) < size) {
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("### OVERFLOW ### (%d %d)\n", (BLE_OTA_QUEUE_SIZE - level - 1), size);
#endif

                if (!m_status) {
                    m_status = BLE_OTA_EVENT_ERR_WRITE;
                }
                armv7m_atomic_orb(&m_sequence, BLE_OTA_SEQUENCE_CANCEL);

                k_work_submit(&m_work);
                
                return;
            }

            if (size) {
                count = BLE_OTA_QUEUE_SIZE - tail;
                
                if (count > size) {
                    count = size;
                }
                
                if (count) {
                    memcpy(&m_data[tail], &data[0], count);
                }
                
                if (size != count) {
                    memcpy(&m_data[0], &data[count], (size - count));
                }
                
                tail += size;
                
                if (tail >= BLE_OTA_QUEUE_SIZE) {
                    tail -= BLE_OTA_QUEUE_SIZE;
                }
                
                m_tail = tail;
                
#if (BLE_TRACE_SUPPORTED == 1)
                armv7m_rtt_printf("ENQUEUE(%d) -> %d\n", (BLE_OTA_QUEUE_SIZE - level - 1), size);
#endif
                
                k_work_submit(&m_work);
            }
        }
    }
}

void BLEOta::countCallback() {
    uint32_t head, tail, level;
    ble_ota_count_t count;

    head = m_head;
    tail = m_tail;
            
    if (tail >= head) {
        level = tail - head;
    } else {
        level = (BLE_OTA_QUEUE_SIZE - head) + tail;
    }

    count.count = (BLE_OTA_QUEUE_SIZE - level - 1);

#if (BLE_TRACE_SUPPORTED == 1)
    armv7m_rtt_printf("COUNT %d\n", count.count);
#endif                

    m_data_characteristic.setValue(&count, sizeof(BLE_OTA_COUNT_SIZE));
}
